#lang reader serval/lang/dwarf

o.riscv64/monitors/certikos.elf:     file format elf64-littleriscv

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x2a (32-bit)
   Version:       2
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_stmt_list   : 0x0
    <10>   DW_AT_low_pc      : 0x80000090
    <18>   DW_AT_high_pc     : 0x800001ac
    <20>   DW_AT_name        : (indirect string, offset: 0x0): bios/entry.S
    <24>   DW_AT_comp_dir    : (indirect string, offset: 0xd): /serval/
    <28>   DW_AT_producer    : (indirect string, offset: 0x16): GNU AS 2.32
    <2c>   DW_AT_language    : 32769	(MIPS assembler)
  Compilation Unit @ offset 0x2e:
   Length:        0x2c1 (32-bit)
   Version:       4
   Abbrev Offset: 0x14
   Pointer Size:  8
 <0><39>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <3a>   DW_AT_producer    : (indirect string, offset: 0xe7): GNU C17 8.3.0 -mstrict-align -mcmodel=medany -mabi=lp64 -march=rv64ima -g -O0 -ffreestanding -fno-stack-protector -fno-strict-aliasing -fno-jump-tables -ffunction-sections -fdata-sections -fno-PIE
    <3e>   DW_AT_language    : 12	(ANSI C99)
    <3f>   DW_AT_name        : (indirect string, offset: 0x91): bios/htif.c
    <43>   DW_AT_comp_dir    : (indirect string, offset: 0xd): /serval/
    <47>   DW_AT_ranges      : 0x0
    <4b>   DW_AT_low_pc      : 0x0
    <53>   DW_AT_stmt_list   : 0x6f
 <1><57>: Abbrev Number: 2 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 1
    <59>   DW_AT_encoding    : 6	(signed char)
    <5a>   DW_AT_name        : (indirect string, offset: 0xab): signed char
 <1><5e>: Abbrev Number: 2 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 2
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x4b): short int
 <1><65>: Abbrev Number: 3 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 5	(signed)
    <68>   DW_AT_name        : int
 <1><6c>: Abbrev Number: 2 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x7b): long int
 <1><73>: Abbrev Number: 4 (DW_TAG_typedef)
    <74>   DW_AT_name        : (indirect string, offset: 0x69): uint8_t
    <78>   DW_AT_decl_file   : 2
    <79>   DW_AT_decl_line   : 46
    <7a>   DW_AT_decl_column : 24
    <7b>   DW_AT_type        : <0x7f>
 <1><7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 1
    <81>   DW_AT_encoding    : 8	(unsigned char)
    <82>   DW_AT_name        : (indirect string, offset: 0xa9): unsigned char
 <1><86>: Abbrev Number: 2 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 2
    <88>   DW_AT_encoding    : 7	(unsigned)
    <89>   DW_AT_name        : (indirect string, offset: 0xce): short unsigned int
 <1><8d>: Abbrev Number: 2 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xc1): unsigned int
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x42): uint64_t
    <99>   DW_AT_decl_file   : 2
    <9a>   DW_AT_decl_line   : 55
    <9b>   DW_AT_decl_column : 25
    <9c>   DW_AT_type        : <0xa5>
 <1><a0>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 2 (DW_TAG_base_type)
    <a6>   DW_AT_byte_size   : 8
    <a7>   DW_AT_encoding    : 7	(unsigned)
    <a8>   DW_AT_name        : (indirect string, offset: 0xbc): long unsigned int
 <1><ac>: Abbrev Number: 2 (DW_TAG_base_type)
    <ad>   DW_AT_byte_size   : 1
    <ae>   DW_AT_encoding    : 2	(boolean)
    <af>   DW_AT_name        : (indirect string, offset: 0xe1): _Bool
 <1><b3>: Abbrev Number: 2 (DW_TAG_base_type)
    <b4>   DW_AT_byte_size   : 1
    <b5>   DW_AT_encoding    : 8	(unsigned char)
    <b6>   DW_AT_name        : (indirect string, offset: 0xb2): char
 <1><ba>: Abbrev Number: 6 (DW_TAG_const_type)
    <bb>   DW_AT_type        : <0xb3>
 <1><bf>: Abbrev Number: 2 (DW_TAG_base_type)
    <c0>   DW_AT_byte_size   : 8
    <c1>   DW_AT_encoding    : 5	(signed)
    <c2>   DW_AT_name        : (indirect string, offset: 0x76): long long int
 <1><c6>: Abbrev Number: 2 (DW_TAG_base_type)
    <c7>   DW_AT_byte_size   : 8
    <c8>   DW_AT_encoding    : 7	(unsigned)
    <c9>   DW_AT_name        : (indirect string, offset: 0xb7): long long unsigned int
 <1><cd>: Abbrev Number: 2 (DW_TAG_base_type)
    <ce>   DW_AT_byte_size   : 16
    <cf>   DW_AT_encoding    : 4	(float)
    <d0>   DW_AT_name        : (indirect string, offset: 0x9d): long double
 <1><d4>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d5>   DW_AT_name        : (indirect string, offset: 0x38): list_head
    <d9>   DW_AT_byte_size   : 16
    <da>   DW_AT_decl_file   : 3
    <db>   DW_AT_decl_line   : 189
    <dc>   DW_AT_decl_column : 8
    <dd>   DW_AT_sibling     : <0xfc>
 <2><e1>: Abbrev Number: 8 (DW_TAG_member)
    <e2>   DW_AT_name        : (indirect string, offset: 0x1d4): next
    <e6>   DW_AT_decl_file   : 3
    <e7>   DW_AT_decl_line   : 190
    <e8>   DW_AT_decl_column : 27
    <e9>   DW_AT_type        : <0xfc>
    <ed>   DW_AT_data_member_location: 0
 <2><ee>: Abbrev Number: 8 (DW_TAG_member)
    <ef>   DW_AT_name        : (indirect string, offset: 0x1cf): prev
    <f3>   DW_AT_decl_file   : 3
    <f4>   DW_AT_decl_line   : 190
    <f5>   DW_AT_decl_column : 34
    <f6>   DW_AT_type        : <0xfc>
    <fa>   DW_AT_data_member_location: 8
 <2><fb>: Abbrev Number: 0
 <1><fc>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <fd>   DW_AT_byte_size   : 8
    <fe>   DW_AT_type        : <0xd4>
 <1><102>: Abbrev Number: 10 (DW_TAG_array_type)
    <103>   DW_AT_type        : <0xba>
    <107>   DW_AT_sibling     : <0x10d>
 <2><10b>: Abbrev Number: 11 (DW_TAG_subrange_type)
 <2><10c>: Abbrev Number: 0
 <1><10d>: Abbrev Number: 6 (DW_TAG_const_type)
    <10e>   DW_AT_type        : <0x102>
 <1><112>: Abbrev Number: 12 (DW_TAG_variable)
    <113>   DW_AT_name        : (indirect string, offset: 0x1be): hex_asc
    <117>   DW_AT_decl_file   : 3
    <118>   DW_AT_decl_line   : 193
    <119>   DW_AT_decl_column : 19
    <11a>   DW_AT_type        : <0x10d>
    <11e>   DW_AT_external    : 1
    <11e>   DW_AT_declaration : 1
 <1><11e>: Abbrev Number: 12 (DW_TAG_variable)
    <11f>   DW_AT_name        : (indirect string, offset: 0x1d9): hex_asc_upper
    <123>   DW_AT_decl_file   : 3
    <124>   DW_AT_decl_line   : 204
    <125>   DW_AT_decl_column : 19
    <126>   DW_AT_type        : <0x10d>
    <12a>   DW_AT_external    : 1
    <12a>   DW_AT_declaration : 1
 <1><12a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <12b>   DW_AT_name        : (indirect string, offset: 0x1ac): console
    <12f>   DW_AT_byte_size   : 40
    <130>   DW_AT_decl_file   : 4
    <131>   DW_AT_decl_line   : 16
    <132>   DW_AT_decl_column : 8
    <133>   DW_AT_sibling     : <0x16c>
 <2><137>: Abbrev Number: 8 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0x238): getchar
    <13c>   DW_AT_decl_file   : 4
    <13d>   DW_AT_decl_line   : 17
    <13e>   DW_AT_decl_column : 15
    <13f>   DW_AT_type        : <0x181>
    <143>   DW_AT_data_member_location: 0
 <2><144>: Abbrev Number: 8 (DW_TAG_member)
    <145>   DW_AT_name        : (indirect string, offset: 0x2e2): putchar
    <149>   DW_AT_decl_file   : 4
    <14a>   DW_AT_decl_line   : 18
    <14b>   DW_AT_decl_column : 16
    <14c>   DW_AT_type        : <0x197>
    <150>   DW_AT_data_member_location: 8
 <2><151>: Abbrev Number: 8 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x55): color
    <156>   DW_AT_decl_file   : 4
    <157>   DW_AT_decl_line   : 19
    <158>   DW_AT_decl_column : 21
    <159>   DW_AT_type        : <0x19d>
    <15d>   DW_AT_data_member_location: 16
 <2><15e>: Abbrev Number: 8 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0xd5b): list
    <163>   DW_AT_decl_file   : 4
    <164>   DW_AT_decl_line   : 20
    <165>   DW_AT_decl_column : 26
    <166>   DW_AT_type        : <0xd4>
    <16a>   DW_AT_data_member_location: 24
 <2><16b>: Abbrev Number: 0
 <1><16c>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <16d>   DW_AT_prototyped  : 1
    <16d>   DW_AT_type        : <0x65>
    <171>   DW_AT_sibling     : <0x17b>
 <2><175>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <176>   DW_AT_type        : <0x17b>
 <2><17a>: Abbrev Number: 0
 <1><17b>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <17c>   DW_AT_byte_size   : 8
    <17d>   DW_AT_type        : <0x12a>
 <1><181>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <182>   DW_AT_byte_size   : 8
    <183>   DW_AT_type        : <0x16c>
 <1><187>: Abbrev Number: 15 (DW_TAG_subroutine_type)
    <188>   DW_AT_prototyped  : 1
    <188>   DW_AT_sibling     : <0x197>
 <2><18c>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <18d>   DW_AT_type        : <0x17b>
 <2><191>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <192>   DW_AT_type        : <0x65>
 <2><196>: Abbrev Number: 0
 <1><197>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <198>   DW_AT_byte_size   : 8
    <199>   DW_AT_type        : <0x187>
 <1><19d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <19e>   DW_AT_byte_size   : 8
    <19f>   DW_AT_type        : <0xba>
 <1><1a3>: Abbrev Number: 16 (DW_TAG_variable)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x8a): tohost
    <1a8>   DW_AT_decl_file   : 1
    <1a9>   DW_AT_decl_line   : 9
    <1aa>   DW_AT_decl_column : 19
    <1ab>   DW_AT_type        : <0xa0>
    <1af>   DW_AT_external    : 1
    <1af>   DW_AT_location    : 9 byte block: 3 0 50 0 80 0 0 0 0 	(DW_OP_addr: 80005000)
 <1><1b9>: Abbrev Number: 16 (DW_TAG_variable)
    <1ba>   DW_AT_name        : (indirect string, offset: 0x1c6): fromhost
    <1be>   DW_AT_decl_file   : 1
    <1bf>   DW_AT_decl_line   : 10
    <1c0>   DW_AT_decl_column : 19
    <1c1>   DW_AT_type        : <0xa0>
    <1c5>   DW_AT_external    : 1
    <1c5>   DW_AT_location    : 9 byte block: 3 8 50 0 80 0 0 0 0 	(DW_OP_addr: 80005008)
 <1><1cf>: Abbrev Number: 17 (DW_TAG_variable)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x2f): has_htif
    <1d4>   DW_AT_decl_file   : 1
    <1d5>   DW_AT_decl_line   : 12
    <1d6>   DW_AT_decl_column : 13
    <1d7>   DW_AT_type        : <0xac>
    <1db>   DW_AT_location    : 9 byte block: 3 0 60 0 80 0 0 0 0 	(DW_OP_addr: 80006000)
 <1><1e5>: Abbrev Number: 18 (DW_TAG_variable)
    <1e6>   DW_AT_name        : con
    <1ea>   DW_AT_decl_file   : 1
    <1eb>   DW_AT_decl_line   : 36
    <1ec>   DW_AT_decl_column : 23
    <1ed>   DW_AT_type        : <0x12a>
    <1f1>   DW_AT_location    : 9 byte block: 3 0 0 0 0 0 0 0 0 	(DW_OP_addr: 0)
 <1><1fb>: Abbrev Number: 19 (DW_TAG_subprogram)
    <1fc>   DW_AT_external    : 1
    <1fc>   DW_AT_name        : (indirect string, offset: 0x5b): htif_shutdown
    <200>   DW_AT_decl_file   : 1
    <201>   DW_AT_decl_line   : 48
    <202>   DW_AT_decl_column : 6
    <203>   DW_AT_prototyped  : 1
    <203>   DW_AT_low_pc      : 0x80000260
    <20b>   DW_AT_high_pc     : 0x50
    <213>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <215>   DW_AT_GNU_all_tail_call_sites: 1
 <1><215>: Abbrev Number: 19 (DW_TAG_subprogram)
    <216>   DW_AT_external    : 1
    <216>   DW_AT_name        : (indirect string, offset: 0x1b4): htif_init
    <21a>   DW_AT_decl_file   : 1
    <21b>   DW_AT_decl_line   : 40
    <21c>   DW_AT_decl_column : 6
    <21d>   DW_AT_prototyped  : 1
    <21d>   DW_AT_low_pc      : 0x0
    <225>   DW_AT_high_pc     : 0x0
    <22d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <22f>   DW_AT_GNU_all_tail_call_sites: 1
 <1><22f>: Abbrev Number: 20 (DW_TAG_subprogram)
    <230>   DW_AT_name        : (indirect string, offset: 0x22): htif_putchar
    <234>   DW_AT_decl_file   : 1
    <235>   DW_AT_decl_line   : 31
    <236>   DW_AT_decl_column : 13
    <237>   DW_AT_prototyped  : 1
    <237>   DW_AT_low_pc      : 0x0
    <23f>   DW_AT_high_pc     : 0x0
    <247>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <249>   DW_AT_GNU_all_tail_call_sites: 1
    <249>   DW_AT_sibling     : <0x26a>
 <2><24d>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <24e>   DW_AT_name        : con
    <252>   DW_AT_decl_file   : 1
    <253>   DW_AT_decl_line   : 31
    <254>   DW_AT_decl_column : 42
    <255>   DW_AT_type        : <0x17b>
    <259>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><25c>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <25d>   DW_AT_name        : c
    <25f>   DW_AT_decl_file   : 1
    <260>   DW_AT_decl_line   : 31
    <261>   DW_AT_decl_column : 51
    <262>   DW_AT_type        : <0x65>
    <266>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><269>: Abbrev Number: 0
 <1><26a>: Abbrev Number: 20 (DW_TAG_subprogram)
    <26b>   DW_AT_name        : (indirect string, offset: 0x84): write_tohost
    <26f>   DW_AT_decl_file   : 1
    <270>   DW_AT_decl_line   : 25
    <271>   DW_AT_decl_column : 13
    <272>   DW_AT_prototyped  : 1
    <272>   DW_AT_low_pc      : 0x80000204
    <27a>   DW_AT_high_pc     : 0x5c
    <282>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <284>   DW_AT_GNU_all_tail_call_sites: 1
    <284>   DW_AT_sibling     : <0x2b6>
 <2><288>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <289>   DW_AT_name        : dev
    <28d>   DW_AT_decl_file   : 1
    <28e>   DW_AT_decl_line   : 25
    <28f>   DW_AT_decl_column : 35
    <290>   DW_AT_type        : <0x94>
    <294>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><297>: Abbrev Number: 21 (DW_TAG_formal_parameter)
    <298>   DW_AT_name        : cmd
    <29c>   DW_AT_decl_file   : 1
    <29d>   DW_AT_decl_line   : 25
    <29e>   DW_AT_decl_column : 49
    <29f>   DW_AT_type        : <0x94>
    <2a3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><2a6>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x20b): data
    <2ab>   DW_AT_decl_file   : 1
    <2ac>   DW_AT_decl_line   : 25
    <2ad>   DW_AT_decl_column : 63
    <2ae>   DW_AT_type        : <0x94>
    <2b2>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><2b5>: Abbrev Number: 0
 <1><2b6>: Abbrev Number: 23 (DW_TAG_subprogram)
    <2b7>   DW_AT_name        : (indirect string, offset: 0x71): wait
    <2bb>   DW_AT_decl_file   : 1
    <2bc>   DW_AT_decl_line   : 14
    <2bd>   DW_AT_decl_column : 13
    <2be>   DW_AT_prototyped  : 1
    <2be>   DW_AT_low_pc      : 0x800001ac
    <2c6>   DW_AT_high_pc     : 0x58
    <2ce>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <2d0>   DW_AT_GNU_all_call_sites: 1
 <2><2d0>: Abbrev Number: 24 (DW_TAG_lexical_block)
    <2d1>   DW_AT_low_pc      : 0x800001bc
    <2d9>   DW_AT_high_pc     : 0x28
 <3><2e1>: Abbrev Number: 18 (DW_TAG_variable)
    <2e2>   DW_AT_name        : val
    <2e6>   DW_AT_decl_file   : 1
    <2e7>   DW_AT_decl_line   : 17
    <2e8>   DW_AT_decl_column : 26
    <2e9>   DW_AT_type        : <0x94>
    <2ed>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><2f0>: Abbrev Number: 0
 <2><2f1>: Abbrev Number: 0
 <1><2f2>: Abbrev Number: 0
  Compilation Unit @ offset 0x2f3:
   Length:        0x4ee (32-bit)
   Version:       4
   Abbrev Offset: 0x16e
   Pointer Size:  8
 <0><2fe>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <2ff>   DW_AT_producer    : (indirect string, offset: 0xe7): GNU C17 8.3.0 -mstrict-align -mcmodel=medany -mabi=lp64 -march=rv64ima -g -O0 -ffreestanding -fno-stack-protector -fno-strict-aliasing -fno-jump-tables -ffunction-sections -fdata-sections -fno-PIE
    <303>   DW_AT_language    : 12	(ANSI C99)
    <304>   DW_AT_name        : (indirect string, offset: 0x252): bios/mcall.c
    <308>   DW_AT_comp_dir    : (indirect string, offset: 0xd): /serval/
    <30c>   DW_AT_ranges      : 0x60
    <310>   DW_AT_low_pc      : 0x0
    <318>   DW_AT_stmt_list   : 0x266
 <1><31c>: Abbrev Number: 2 (DW_TAG_base_type)
    <31d>   DW_AT_byte_size   : 1
    <31e>   DW_AT_encoding    : 6	(signed char)
    <31f>   DW_AT_name        : (indirect string, offset: 0xab): signed char
 <1><323>: Abbrev Number: 2 (DW_TAG_base_type)
    <324>   DW_AT_byte_size   : 2
    <325>   DW_AT_encoding    : 5	(signed)
    <326>   DW_AT_name        : (indirect string, offset: 0x4b): short int
 <1><32a>: Abbrev Number: 3 (DW_TAG_base_type)
    <32b>   DW_AT_byte_size   : 4
    <32c>   DW_AT_encoding    : 5	(signed)
    <32d>   DW_AT_name        : int
 <1><331>: Abbrev Number: 2 (DW_TAG_base_type)
    <332>   DW_AT_byte_size   : 8
    <333>   DW_AT_encoding    : 5	(signed)
    <334>   DW_AT_name        : (indirect string, offset: 0x7b): long int
 <1><338>: Abbrev Number: 4 (DW_TAG_typedef)
    <339>   DW_AT_name        : (indirect string, offset: 0x69): uint8_t
    <33d>   DW_AT_decl_file   : 3
    <33e>   DW_AT_decl_line   : 46
    <33f>   DW_AT_decl_column : 24
    <340>   DW_AT_type        : <0x344>
 <1><344>: Abbrev Number: 2 (DW_TAG_base_type)
    <345>   DW_AT_byte_size   : 1
    <346>   DW_AT_encoding    : 8	(unsigned char)
    <347>   DW_AT_name        : (indirect string, offset: 0xa9): unsigned char
 <1><34b>: Abbrev Number: 2 (DW_TAG_base_type)
    <34c>   DW_AT_byte_size   : 2
    <34d>   DW_AT_encoding    : 7	(unsigned)
    <34e>   DW_AT_name        : (indirect string, offset: 0xce): short unsigned int
 <1><352>: Abbrev Number: 2 (DW_TAG_base_type)
    <353>   DW_AT_byte_size   : 4
    <354>   DW_AT_encoding    : 7	(unsigned)
    <355>   DW_AT_name        : (indirect string, offset: 0xc1): unsigned int
 <1><359>: Abbrev Number: 4 (DW_TAG_typedef)
    <35a>   DW_AT_name        : (indirect string, offset: 0x42): uint64_t
    <35e>   DW_AT_decl_file   : 3
    <35f>   DW_AT_decl_line   : 55
    <360>   DW_AT_decl_column : 25
    <361>   DW_AT_type        : <0x36a>
 <1><365>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <366>   DW_AT_type        : <0x359>
 <1><36a>: Abbrev Number: 2 (DW_TAG_base_type)
    <36b>   DW_AT_byte_size   : 8
    <36c>   DW_AT_encoding    : 7	(unsigned)
    <36d>   DW_AT_name        : (indirect string, offset: 0xbc): long unsigned int
 <1><371>: Abbrev Number: 2 (DW_TAG_base_type)
    <372>   DW_AT_byte_size   : 1
    <373>   DW_AT_encoding    : 2	(boolean)
    <374>   DW_AT_name        : (indirect string, offset: 0xe1): _Bool
 <1><378>: Abbrev Number: 2 (DW_TAG_base_type)
    <379>   DW_AT_byte_size   : 1
    <37a>   DW_AT_encoding    : 8	(unsigned char)
    <37b>   DW_AT_name        : (indirect string, offset: 0xb2): char
 <1><37f>: Abbrev Number: 6 (DW_TAG_const_type)
    <380>   DW_AT_type        : <0x378>
 <1><384>: Abbrev Number: 2 (DW_TAG_base_type)
    <385>   DW_AT_byte_size   : 8
    <386>   DW_AT_encoding    : 5	(signed)
    <387>   DW_AT_name        : (indirect string, offset: 0x76): long long int
 <1><38b>: Abbrev Number: 2 (DW_TAG_base_type)
    <38c>   DW_AT_byte_size   : 8
    <38d>   DW_AT_encoding    : 7	(unsigned)
    <38e>   DW_AT_name        : (indirect string, offset: 0xb7): long long unsigned int
 <1><392>: Abbrev Number: 2 (DW_TAG_base_type)
    <393>   DW_AT_byte_size   : 16
    <394>   DW_AT_encoding    : 4	(float)
    <395>   DW_AT_name        : (indirect string, offset: 0x9d): long double
 <1><399>: Abbrev Number: 4 (DW_TAG_typedef)
    <39a>   DW_AT_name        : (indirect string, offset: 0x2f3): phys_addr_t
    <39e>   DW_AT_decl_file   : 4
    <39f>   DW_AT_decl_line   : 184
    <3a0>   DW_AT_decl_column : 25
    <3a1>   DW_AT_type        : <0x359>
 <1><3a5>: Abbrev Number: 7 (DW_TAG_array_type)
    <3a6>   DW_AT_type        : <0x37f>
    <3aa>   DW_AT_sibling     : <0x3b0>
 <2><3ae>: Abbrev Number: 8 (DW_TAG_subrange_type)
 <2><3af>: Abbrev Number: 0
 <1><3b0>: Abbrev Number: 6 (DW_TAG_const_type)
    <3b1>   DW_AT_type        : <0x3a5>
 <1><3b5>: Abbrev Number: 9 (DW_TAG_variable)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x1be): hex_asc
    <3ba>   DW_AT_decl_file   : 4
    <3bb>   DW_AT_decl_line   : 193
    <3bc>   DW_AT_decl_column : 19
    <3bd>   DW_AT_type        : <0x3b0>
    <3c1>   DW_AT_external    : 1
    <3c1>   DW_AT_declaration : 1
 <1><3c1>: Abbrev Number: 9 (DW_TAG_variable)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x1d9): hex_asc_upper
    <3c6>   DW_AT_decl_file   : 4
    <3c7>   DW_AT_decl_line   : 204
    <3c8>   DW_AT_decl_column : 19
    <3c9>   DW_AT_type        : <0x3b0>
    <3cd>   DW_AT_external    : 1
    <3cd>   DW_AT_declaration : 1
 <1><3cd>: Abbrev Number: 9 (DW_TAG_variable)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x27c): va_pa_offset
    <3d2>   DW_AT_decl_file   : 5
    <3d3>   DW_AT_decl_line   : 14
    <3d4>   DW_AT_decl_column : 22
    <3d5>   DW_AT_type        : <0x36a>
    <3d9>   DW_AT_external    : 1
    <3d9>   DW_AT_declaration : 1
 <1><3d9>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3da>   DW_AT_name        : (indirect string, offset: 0xd99): pt_regs
    <3de>   DW_AT_byte_size   : 248
    <3df>   DW_AT_decl_file   : 6
    <3e0>   DW_AT_decl_line   : 7
    <3e1>   DW_AT_decl_column : 8
    <3e2>   DW_AT_sibling     : <0x55d>
 <2><3e6>: Abbrev Number: 11 (DW_TAG_member)
    <3e7>   DW_AT_name        : ra
    <3ea>   DW_AT_decl_file   : 6
    <3eb>   DW_AT_decl_line   : 8
    <3ec>   DW_AT_decl_column : 23
    <3ed>   DW_AT_type        : <0x36a>
    <3f1>   DW_AT_data_member_location: 0
 <2><3f2>: Abbrev Number: 11 (DW_TAG_member)
    <3f3>   DW_AT_name        : sp
    <3f6>   DW_AT_decl_file   : 6
    <3f7>   DW_AT_decl_line   : 9
    <3f8>   DW_AT_decl_column : 23
    <3f9>   DW_AT_type        : <0x36a>
    <3fd>   DW_AT_data_member_location: 8
 <2><3fe>: Abbrev Number: 11 (DW_TAG_member)
    <3ff>   DW_AT_name        : gp
    <402>   DW_AT_decl_file   : 6
    <403>   DW_AT_decl_line   : 10
    <404>   DW_AT_decl_column : 23
    <405>   DW_AT_type        : <0x36a>
    <409>   DW_AT_data_member_location: 16
 <2><40a>: Abbrev Number: 11 (DW_TAG_member)
    <40b>   DW_AT_name        : tp
    <40e>   DW_AT_decl_file   : 6
    <40f>   DW_AT_decl_line   : 11
    <410>   DW_AT_decl_column : 23
    <411>   DW_AT_type        : <0x36a>
    <415>   DW_AT_data_member_location: 24
 <2><416>: Abbrev Number: 11 (DW_TAG_member)
    <417>   DW_AT_name        : t0
    <41a>   DW_AT_decl_file   : 6
    <41b>   DW_AT_decl_line   : 12
    <41c>   DW_AT_decl_column : 23
    <41d>   DW_AT_type        : <0x36a>
    <421>   DW_AT_data_member_location: 32
 <2><422>: Abbrev Number: 11 (DW_TAG_member)
    <423>   DW_AT_name        : t1
    <426>   DW_AT_decl_file   : 6
    <427>   DW_AT_decl_line   : 13
    <428>   DW_AT_decl_column : 23
    <429>   DW_AT_type        : <0x36a>
    <42d>   DW_AT_data_member_location: 40
 <2><42e>: Abbrev Number: 11 (DW_TAG_member)
    <42f>   DW_AT_name        : t2
    <432>   DW_AT_decl_file   : 6
    <433>   DW_AT_decl_line   : 14
    <434>   DW_AT_decl_column : 23
    <435>   DW_AT_type        : <0x36a>
    <439>   DW_AT_data_member_location: 48
 <2><43a>: Abbrev Number: 11 (DW_TAG_member)
    <43b>   DW_AT_name        : s0
    <43e>   DW_AT_decl_file   : 6
    <43f>   DW_AT_decl_line   : 15
    <440>   DW_AT_decl_column : 23
    <441>   DW_AT_type        : <0x36a>
    <445>   DW_AT_data_member_location: 56
 <2><446>: Abbrev Number: 11 (DW_TAG_member)
    <447>   DW_AT_name        : s1
    <44a>   DW_AT_decl_file   : 6
    <44b>   DW_AT_decl_line   : 16
    <44c>   DW_AT_decl_column : 23
    <44d>   DW_AT_type        : <0x36a>
    <451>   DW_AT_data_member_location: 64
 <2><452>: Abbrev Number: 11 (DW_TAG_member)
    <453>   DW_AT_name        : a0
    <456>   DW_AT_decl_file   : 6
    <457>   DW_AT_decl_line   : 17
    <458>   DW_AT_decl_column : 23
    <459>   DW_AT_type        : <0x36a>
    <45d>   DW_AT_data_member_location: 72
 <2><45e>: Abbrev Number: 11 (DW_TAG_member)
    <45f>   DW_AT_name        : a1
    <462>   DW_AT_decl_file   : 6
    <463>   DW_AT_decl_line   : 18
    <464>   DW_AT_decl_column : 23
    <465>   DW_AT_type        : <0x36a>
    <469>   DW_AT_data_member_location: 80
 <2><46a>: Abbrev Number: 11 (DW_TAG_member)
    <46b>   DW_AT_name        : a2
    <46e>   DW_AT_decl_file   : 6
    <46f>   DW_AT_decl_line   : 19
    <470>   DW_AT_decl_column : 23
    <471>   DW_AT_type        : <0x36a>
    <475>   DW_AT_data_member_location: 88
 <2><476>: Abbrev Number: 11 (DW_TAG_member)
    <477>   DW_AT_name        : a3
    <47a>   DW_AT_decl_file   : 6
    <47b>   DW_AT_decl_line   : 20
    <47c>   DW_AT_decl_column : 23
    <47d>   DW_AT_type        : <0x36a>
    <481>   DW_AT_data_member_location: 96
 <2><482>: Abbrev Number: 11 (DW_TAG_member)
    <483>   DW_AT_name        : a4
    <486>   DW_AT_decl_file   : 6
    <487>   DW_AT_decl_line   : 21
    <488>   DW_AT_decl_column : 23
    <489>   DW_AT_type        : <0x36a>
    <48d>   DW_AT_data_member_location: 104
 <2><48e>: Abbrev Number: 11 (DW_TAG_member)
    <48f>   DW_AT_name        : a5
    <492>   DW_AT_decl_file   : 6
    <493>   DW_AT_decl_line   : 22
    <494>   DW_AT_decl_column : 23
    <495>   DW_AT_type        : <0x36a>
    <499>   DW_AT_data_member_location: 112
 <2><49a>: Abbrev Number: 11 (DW_TAG_member)
    <49b>   DW_AT_name        : a6
    <49e>   DW_AT_decl_file   : 6
    <49f>   DW_AT_decl_line   : 23
    <4a0>   DW_AT_decl_column : 23
    <4a1>   DW_AT_type        : <0x36a>
    <4a5>   DW_AT_data_member_location: 120
 <2><4a6>: Abbrev Number: 11 (DW_TAG_member)
    <4a7>   DW_AT_name        : a7
    <4aa>   DW_AT_decl_file   : 6
    <4ab>   DW_AT_decl_line   : 24
    <4ac>   DW_AT_decl_column : 23
    <4ad>   DW_AT_type        : <0x36a>
    <4b1>   DW_AT_data_member_location: 128
 <2><4b2>: Abbrev Number: 11 (DW_TAG_member)
    <4b3>   DW_AT_name        : s2
    <4b6>   DW_AT_decl_file   : 6
    <4b7>   DW_AT_decl_line   : 25
    <4b8>   DW_AT_decl_column : 23
    <4b9>   DW_AT_type        : <0x36a>
    <4bd>   DW_AT_data_member_location: 136
 <2><4be>: Abbrev Number: 11 (DW_TAG_member)
    <4bf>   DW_AT_name        : s3
    <4c2>   DW_AT_decl_file   : 6
    <4c3>   DW_AT_decl_line   : 26
    <4c4>   DW_AT_decl_column : 23
    <4c5>   DW_AT_type        : <0x36a>
    <4c9>   DW_AT_data_member_location: 144
 <2><4ca>: Abbrev Number: 11 (DW_TAG_member)
    <4cb>   DW_AT_name        : s4
    <4ce>   DW_AT_decl_file   : 6
    <4cf>   DW_AT_decl_line   : 27
    <4d0>   DW_AT_decl_column : 23
    <4d1>   DW_AT_type        : <0x36a>
    <4d5>   DW_AT_data_member_location: 152
 <2><4d6>: Abbrev Number: 11 (DW_TAG_member)
    <4d7>   DW_AT_name        : s5
    <4da>   DW_AT_decl_file   : 6
    <4db>   DW_AT_decl_line   : 28
    <4dc>   DW_AT_decl_column : 23
    <4dd>   DW_AT_type        : <0x36a>
    <4e1>   DW_AT_data_member_location: 160
 <2><4e2>: Abbrev Number: 11 (DW_TAG_member)
    <4e3>   DW_AT_name        : s6
    <4e6>   DW_AT_decl_file   : 6
    <4e7>   DW_AT_decl_line   : 29
    <4e8>   DW_AT_decl_column : 23
    <4e9>   DW_AT_type        : <0x36a>
    <4ed>   DW_AT_data_member_location: 168
 <2><4ee>: Abbrev Number: 11 (DW_TAG_member)
    <4ef>   DW_AT_name        : s7
    <4f2>   DW_AT_decl_file   : 6
    <4f3>   DW_AT_decl_line   : 30
    <4f4>   DW_AT_decl_column : 23
    <4f5>   DW_AT_type        : <0x36a>
    <4f9>   DW_AT_data_member_location: 176
 <2><4fa>: Abbrev Number: 11 (DW_TAG_member)
    <4fb>   DW_AT_name        : s8
    <4fe>   DW_AT_decl_file   : 6
    <4ff>   DW_AT_decl_line   : 31
    <500>   DW_AT_decl_column : 23
    <501>   DW_AT_type        : <0x36a>
    <505>   DW_AT_data_member_location: 184
 <2><506>: Abbrev Number: 11 (DW_TAG_member)
    <507>   DW_AT_name        : s9
    <50a>   DW_AT_decl_file   : 6
    <50b>   DW_AT_decl_line   : 32
    <50c>   DW_AT_decl_column : 23
    <50d>   DW_AT_type        : <0x36a>
    <511>   DW_AT_data_member_location: 192
 <2><512>: Abbrev Number: 11 (DW_TAG_member)
    <513>   DW_AT_name        : s10
    <517>   DW_AT_decl_file   : 6
    <518>   DW_AT_decl_line   : 33
    <519>   DW_AT_decl_column : 23
    <51a>   DW_AT_type        : <0x36a>
    <51e>   DW_AT_data_member_location: 200
 <2><51f>: Abbrev Number: 11 (DW_TAG_member)
    <520>   DW_AT_name        : s11
    <524>   DW_AT_decl_file   : 6
    <525>   DW_AT_decl_line   : 34
    <526>   DW_AT_decl_column : 23
    <527>   DW_AT_type        : <0x36a>
    <52b>   DW_AT_data_member_location: 208
 <2><52c>: Abbrev Number: 11 (DW_TAG_member)
    <52d>   DW_AT_name        : t3
    <530>   DW_AT_decl_file   : 6
    <531>   DW_AT_decl_line   : 35
    <532>   DW_AT_decl_column : 23
    <533>   DW_AT_type        : <0x36a>
    <537>   DW_AT_data_member_location: 216
 <2><538>: Abbrev Number: 11 (DW_TAG_member)
    <539>   DW_AT_name        : t4
    <53c>   DW_AT_decl_file   : 6
    <53d>   DW_AT_decl_line   : 36
    <53e>   DW_AT_decl_column : 23
    <53f>   DW_AT_type        : <0x36a>
    <543>   DW_AT_data_member_location: 224
 <2><544>: Abbrev Number: 11 (DW_TAG_member)
    <545>   DW_AT_name        : t5
    <548>   DW_AT_decl_file   : 6
    <549>   DW_AT_decl_line   : 37
    <54a>   DW_AT_decl_column : 23
    <54b>   DW_AT_type        : <0x36a>
    <54f>   DW_AT_data_member_location: 232
 <2><550>: Abbrev Number: 11 (DW_TAG_member)
    <551>   DW_AT_name        : t6
    <554>   DW_AT_decl_file   : 6
    <555>   DW_AT_decl_line   : 38
    <556>   DW_AT_decl_column : 23
    <557>   DW_AT_type        : <0x36a>
    <55b>   DW_AT_data_member_location: 240
 <2><55c>: Abbrev Number: 0
 <1><55d>: Abbrev Number: 9 (DW_TAG_variable)
    <55e>   DW_AT_name        : (indirect string, offset: 0x21f): kernel_dtb
    <562>   DW_AT_decl_file   : 7
    <563>   DW_AT_decl_line   : 6
    <564>   DW_AT_decl_column : 20
    <565>   DW_AT_type        : <0x399>
    <569>   DW_AT_external    : 1
    <569>   DW_AT_declaration : 1
 <1><569>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <56a>   DW_AT_byte_size   : 8
    <56b>   DW_AT_type        : <0x37f>
 <1><56f>: Abbrev Number: 7 (DW_TAG_array_type)
    <570>   DW_AT_type        : <0x378>
    <574>   DW_AT_sibling     : <0x57a>
 <2><578>: Abbrev Number: 8 (DW_TAG_subrange_type)
 <2><579>: Abbrev Number: 0
 <1><57a>: Abbrev Number: 9 (DW_TAG_variable)
    <57b>   DW_AT_name        : (indirect string, offset: 0x2ff): boot_command_line
    <57f>   DW_AT_decl_file   : 8
    <580>   DW_AT_decl_line   : 5
    <581>   DW_AT_decl_column : 13
    <582>   DW_AT_type        : <0x56f>
    <586>   DW_AT_external    : 1
    <586>   DW_AT_declaration : 1
 <1><586>: Abbrev Number: 10 (DW_TAG_structure_type)
    <587>   DW_AT_name        : (indirect string, offset: 0x1e7): memblock_region
    <58b>   DW_AT_byte_size   : 16
    <58c>   DW_AT_decl_file   : 9
    <58d>   DW_AT_decl_line   : 14
    <58e>   DW_AT_decl_column : 8
    <58f>   DW_AT_sibling     : <0x5ae>
 <2><593>: Abbrev Number: 13 (DW_TAG_member)
    <594>   DW_AT_name        : (indirect string, offset: 0x34c): base
    <598>   DW_AT_decl_file   : 9
    <599>   DW_AT_decl_line   : 15
    <59a>   DW_AT_decl_column : 21
    <59b>   DW_AT_type        : <0x399>
    <59f>   DW_AT_data_member_location: 0
 <2><5a0>: Abbrev Number: 13 (DW_TAG_member)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x204): size
    <5a5>   DW_AT_decl_file   : 9
    <5a6>   DW_AT_decl_line   : 16
    <5a7>   DW_AT_decl_column : 21
    <5a8>   DW_AT_type        : <0x399>
    <5ac>   DW_AT_data_member_location: 8
 <2><5ad>: Abbrev Number: 0
 <1><5ae>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5af>   DW_AT_name        : (indirect string, offset: 0x2b9): memblock_type
    <5b3>   DW_AT_byte_size   : 40
    <5b4>   DW_AT_decl_file   : 9
    <5b5>   DW_AT_decl_line   : 19
    <5b6>   DW_AT_decl_column : 8
    <5b7>   DW_AT_sibling     : <0x5fd>
 <2><5bb>: Abbrev Number: 11 (DW_TAG_member)
    <5bc>   DW_AT_name        : cnt
    <5c0>   DW_AT_decl_file   : 9
    <5c1>   DW_AT_decl_line   : 20
    <5c2>   DW_AT_decl_column : 23
    <5c3>   DW_AT_type        : <0x36a>
    <5c7>   DW_AT_data_member_location: 0
 <2><5c8>: Abbrev Number: 11 (DW_TAG_member)
    <5c9>   DW_AT_name        : max
    <5cd>   DW_AT_decl_file   : 9
    <5ce>   DW_AT_decl_line   : 21
    <5cf>   DW_AT_decl_column : 23
    <5d0>   DW_AT_type        : <0x36a>
    <5d4>   DW_AT_data_member_location: 8
 <2><5d5>: Abbrev Number: 13 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0x1fe): total_size
    <5da>   DW_AT_decl_file   : 9
    <5db>   DW_AT_decl_line   : 22
    <5dc>   DW_AT_decl_column : 21
    <5dd>   DW_AT_type        : <0x399>
    <5e1>   DW_AT_data_member_location: 16
 <2><5e2>: Abbrev Number: 13 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x274): regions
    <5e7>   DW_AT_decl_file   : 9
    <5e8>   DW_AT_decl_line   : 23
    <5e9>   DW_AT_decl_column : 33
    <5ea>   DW_AT_type        : <0x5fd>
    <5ee>   DW_AT_data_member_location: 24
 <2><5ef>: Abbrev Number: 13 (DW_TAG_member)
    <5f0>   DW_AT_name        : (indirect string, offset: 0xa15): name
    <5f4>   DW_AT_decl_file   : 9
    <5f5>   DW_AT_decl_line   : 24
    <5f6>   DW_AT_decl_column : 15
    <5f7>   DW_AT_type        : <0x603>
    <5fb>   DW_AT_data_member_location: 32
 <2><5fc>: Abbrev Number: 0
 <1><5fd>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <5fe>   DW_AT_byte_size   : 8
    <5ff>   DW_AT_type        : <0x586>
 <1><603>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <604>   DW_AT_byte_size   : 8
    <605>   DW_AT_type        : <0x378>
 <1><609>: Abbrev Number: 10 (DW_TAG_structure_type)
    <60a>   DW_AT_name        : (indirect string, offset: 0x240): memblock
    <60e>   DW_AT_byte_size   : 80
    <60f>   DW_AT_decl_file   : 9
    <610>   DW_AT_decl_line   : 27
    <611>   DW_AT_decl_column : 8
    <612>   DW_AT_sibling     : <0x631>
 <2><616>: Abbrev Number: 13 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0xb70): memory
    <61b>   DW_AT_decl_file   : 9
    <61c>   DW_AT_decl_line   : 28
    <61d>   DW_AT_decl_column : 30
    <61e>   DW_AT_type        : <0x5ae>
    <622>   DW_AT_data_member_location: 0
 <2><623>: Abbrev Number: 13 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x249): reserved
    <628>   DW_AT_decl_file   : 9
    <629>   DW_AT_decl_line   : 29
    <62a>   DW_AT_decl_column : 30
    <62b>   DW_AT_type        : <0x5ae>
    <62f>   DW_AT_data_member_location: 40
 <2><630>: Abbrev Number: 0
 <1><631>: Abbrev Number: 9 (DW_TAG_variable)
    <632>   DW_AT_name        : (indirect string, offset: 0x240): memblock
    <636>   DW_AT_decl_file   : 9
    <637>   DW_AT_decl_line   : 32
    <638>   DW_AT_decl_column : 24
    <639>   DW_AT_type        : <0x609>
    <63d>   DW_AT_external    : 1
    <63d>   DW_AT_declaration : 1
 <1><63d>: Abbrev Number: 9 (DW_TAG_variable)
    <63e>   DW_AT_name        : (indirect string, offset: 0x1f7): _stext
    <642>   DW_AT_decl_file   : 10
    <643>   DW_AT_decl_line   : 3
    <644>   DW_AT_decl_column : 13
    <645>   DW_AT_type        : <0x56f>
    <649>   DW_AT_external    : 1
    <649>   DW_AT_declaration : 1
 <1><649>: Abbrev Number: 9 (DW_TAG_variable)
    <64a>   DW_AT_name        : (indirect string, offset: 0x2b2): _etext
    <64e>   DW_AT_decl_file   : 10
    <64f>   DW_AT_decl_line   : 3
    <650>   DW_AT_decl_column : 23
    <651>   DW_AT_type        : <0x56f>
    <655>   DW_AT_external    : 1
    <655>   DW_AT_declaration : 1
 <1><655>: Abbrev Number: 9 (DW_TAG_variable)
    <656>   DW_AT_name        : (indirect string, offset: 0x311): _sdata
    <65a>   DW_AT_decl_file   : 10
    <65b>   DW_AT_decl_line   : 4
    <65c>   DW_AT_decl_column : 13
    <65d>   DW_AT_type        : <0x56f>
    <661>   DW_AT_external    : 1
    <661>   DW_AT_declaration : 1
 <1><661>: Abbrev Number: 9 (DW_TAG_variable)
    <662>   DW_AT_name        : (indirect string, offset: 0x209): _edata
    <666>   DW_AT_decl_file   : 10
    <667>   DW_AT_decl_line   : 4
    <668>   DW_AT_decl_column : 23
    <669>   DW_AT_type        : <0x56f>
    <66d>   DW_AT_external    : 1
    <66d>   DW_AT_declaration : 1
 <1><66d>: Abbrev Number: 9 (DW_TAG_variable)
    <66e>   DW_AT_name        : (indirect string, offset: 0x218): _start
    <672>   DW_AT_decl_file   : 10
    <673>   DW_AT_decl_line   : 5
    <674>   DW_AT_decl_column : 13
    <675>   DW_AT_type        : <0x56f>
    <679>   DW_AT_external    : 1
    <679>   DW_AT_declaration : 1
 <1><679>: Abbrev Number: 9 (DW_TAG_variable)
    <67a>   DW_AT_name        : (indirect string, offset: 0x2cf): _end
    <67e>   DW_AT_decl_file   : 10
    <67f>   DW_AT_decl_line   : 5
    <680>   DW_AT_decl_column : 23
    <681>   DW_AT_type        : <0x56f>
    <685>   DW_AT_external    : 1
    <685>   DW_AT_declaration : 1
 <1><685>: Abbrev Number: 9 (DW_TAG_variable)
    <686>   DW_AT_name        : (indirect string, offset: 0x289): __bss_start
    <68a>   DW_AT_decl_file   : 10
    <68b>   DW_AT_decl_line   : 6
    <68c>   DW_AT_decl_column : 13
    <68d>   DW_AT_type        : <0x56f>
    <691>   DW_AT_external    : 1
    <691>   DW_AT_declaration : 1
 <1><691>: Abbrev Number: 9 (DW_TAG_variable)
    <692>   DW_AT_name        : (indirect string, offset: 0x25f): __bss_end
    <696>   DW_AT_decl_file   : 10
    <697>   DW_AT_decl_line   : 6
    <698>   DW_AT_decl_column : 28
    <699>   DW_AT_type        : <0x56f>
    <69d>   DW_AT_external    : 1
    <69d>   DW_AT_declaration : 1
 <1><69d>: Abbrev Number: 9 (DW_TAG_variable)
    <69e>   DW_AT_name        : (indirect string, offset: 0x210): _payload_start
    <6a2>   DW_AT_decl_file   : 10
    <6a3>   DW_AT_decl_line   : 7
    <6a4>   DW_AT_decl_column : 13
    <6a5>   DW_AT_type        : <0x56f>
    <6a9>   DW_AT_external    : 1
    <6a9>   DW_AT_declaration : 1
 <1><6a9>: Abbrev Number: 9 (DW_TAG_variable)
    <6aa>   DW_AT_name        : (indirect string, offset: 0x2c7): _payload_end
    <6ae>   DW_AT_decl_file   : 10
    <6af>   DW_AT_decl_line   : 7
    <6b0>   DW_AT_decl_column : 31
    <6b1>   DW_AT_type        : <0x56f>
    <6b5>   DW_AT_external    : 1
    <6b5>   DW_AT_declaration : 1
 <1><6b5>: Abbrev Number: 14 (DW_TAG_variable)
    <6b6>   DW_AT_specification: <0x55d>
    <6ba>   DW_AT_decl_file   : 2
    <6bb>   DW_AT_decl_line   : 11
    <6bc>   DW_AT_decl_column : 13
    <6bd>   DW_AT_location    : 9 byte block: 3 0 0 0 0 0 0 0 0 	(DW_OP_addr: 0)
 <1><6c7>: Abbrev Number: 9 (DW_TAG_variable)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x8a): tohost
    <6cc>   DW_AT_decl_file   : 2
    <6cd>   DW_AT_decl_line   : 60
    <6ce>   DW_AT_decl_column : 26
    <6cf>   DW_AT_type        : <0x365>
    <6d3>   DW_AT_external    : 1
    <6d3>   DW_AT_declaration : 1
 <1><6d3>: Abbrev Number: 15 (DW_TAG_subprogram)
    <6d4>   DW_AT_external    : 1
    <6d4>   DW_AT_name        : (indirect string, offset: 0x2ea): do_mcall
    <6d8>   DW_AT_decl_file   : 2
    <6d9>   DW_AT_decl_line   : 85
    <6da>   DW_AT_decl_column : 6
    <6db>   DW_AT_prototyped  : 1
    <6db>   DW_AT_type        : <0x331>
    <6df>   DW_AT_low_pc      : 0x0
    <6e7>   DW_AT_high_pc     : 0x0
    <6ef>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6f1>   DW_AT_GNU_all_tail_call_sites: 1
    <6f1>   DW_AT_sibling     : <0x720>
 <2><6f5>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <6f6>   DW_AT_name        : (indirect string, offset: 0xf61): regs
    <6fa>   DW_AT_decl_file   : 2
    <6fb>   DW_AT_decl_line   : 85
    <6fc>   DW_AT_decl_column : 31
    <6fd>   DW_AT_type        : <0x720>
    <701>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><704>: Abbrev Number: 17 (DW_TAG_variable)
    <705>   DW_AT_name        : nr
    <708>   DW_AT_decl_file   : 2
    <709>   DW_AT_decl_line   : 87
    <70a>   DW_AT_decl_column : 23
    <70b>   DW_AT_type        : <0x36a>
    <70f>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><712>: Abbrev Number: 17 (DW_TAG_variable)
    <713>   DW_AT_name        : r
    <715>   DW_AT_decl_file   : 2
    <716>   DW_AT_decl_line   : 88
    <717>   DW_AT_decl_column : 14
    <718>   DW_AT_type        : <0x331>
    <71c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><71f>: Abbrev Number: 0
 <1><720>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <721>   DW_AT_byte_size   : 8
    <722>   DW_AT_type        : <0x3d9>
 <1><726>: Abbrev Number: 18 (DW_TAG_subprogram)
    <727>   DW_AT_external    : 1
    <727>   DW_AT_name        : (indirect string, offset: 0x269): mcall_init
    <72b>   DW_AT_decl_file   : 2
    <72c>   DW_AT_decl_line   : 79
    <72d>   DW_AT_decl_column : 6
    <72e>   DW_AT_prototyped  : 1
    <72e>   DW_AT_low_pc      : 0x800002b0
    <736>   DW_AT_high_pc     : 0x20
    <73e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <740>   DW_AT_GNU_all_call_sites: 1
    <740>   DW_AT_sibling     : <0x754>
 <2><744>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <745>   DW_AT_name        : dtb
    <749>   DW_AT_decl_file   : 2
    <74a>   DW_AT_decl_line   : 79
    <74b>   DW_AT_decl_column : 29
    <74c>   DW_AT_type        : <0x399>
    <750>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><753>: Abbrev Number: 0
 <1><754>: Abbrev Number: 20 (DW_TAG_subprogram)
    <755>   DW_AT_external    : 1
    <755>   DW_AT_name        : (indirect string, offset: 0x295): mcall_shutdown
    <759>   DW_AT_decl_file   : 2
    <75a>   DW_AT_decl_line   : 73
    <75b>   DW_AT_decl_column : 15
    <75c>   DW_AT_prototyped  : 1
    <75c>   DW_AT_noreturn    : 1
    <75c>   DW_AT_low_pc      : 0x0
    <764>   DW_AT_high_pc     : 0x0
    <76c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <76e>   DW_AT_GNU_all_call_sites: 1
 <1><76e>: Abbrev Number: 21 (DW_TAG_subprogram)
    <76f>   DW_AT_external    : 1
    <76f>   DW_AT_name        : (indirect string, offset: 0x22a): mcall_console_getchar
    <773>   DW_AT_decl_file   : 2
    <774>   DW_AT_decl_line   : 67
    <775>   DW_AT_decl_column : 6
    <776>   DW_AT_prototyped  : 1
    <776>   DW_AT_type        : <0x331>
    <77a>   DW_AT_low_pc      : 0x0
    <782>   DW_AT_high_pc     : 0x0
    <78a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <78c>   DW_AT_GNU_all_call_sites: 1
 <1><78c>: Abbrev Number: 18 (DW_TAG_subprogram)
    <78d>   DW_AT_external    : 1
    <78d>   DW_AT_name        : (indirect string, offset: 0x2d4): mcall_console_putchar
    <791>   DW_AT_decl_file   : 2
    <792>   DW_AT_decl_line   : 62
    <793>   DW_AT_decl_column : 6
    <794>   DW_AT_prototyped  : 1
    <794>   DW_AT_low_pc      : 0x0
    <79c>   DW_AT_high_pc     : 0x0
    <7a4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7a6>   DW_AT_GNU_all_call_sites: 1
    <7a6>   DW_AT_sibling     : <0x7b8>
 <2><7aa>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7ab>   DW_AT_name        : c
    <7ad>   DW_AT_decl_file   : 2
    <7ae>   DW_AT_decl_line   : 62
    <7af>   DW_AT_decl_column : 36
    <7b0>   DW_AT_type        : <0x338>
    <7b4>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 22 (DW_TAG_subprogram)
    <7b9>   DW_AT_name        : (indirect string, offset: 0x2a4): printk_unused
    <7bd>   DW_AT_decl_file   : 1
    <7be>   DW_AT_decl_line   : 32
    <7bf>   DW_AT_decl_column : 36
    <7c0>   DW_AT_prototyped  : 1
    <7c0>   DW_AT_low_pc      : 0x0
    <7c8>   DW_AT_high_pc     : 0x0
    <7d0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7d2>   DW_AT_GNU_all_call_sites: 1
 <2><7d2>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <7d3>   DW_AT_name        : fmt
    <7d7>   DW_AT_decl_file   : 1
    <7d8>   DW_AT_decl_line   : 32
    <7d9>   DW_AT_decl_column : 62
    <7da>   DW_AT_type        : <0x569>
    <7de>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><7e2>: Abbrev Number: 23 (DW_TAG_unspecified_parameters)
 <2><7e3>: Abbrev Number: 0
 <1><7e4>: Abbrev Number: 0
  Compilation Unit @ offset 0x7e5:
   Length:        0x207 (32-bit)
   Version:       4
   Abbrev Offset: 0x2e4
   Pointer Size:  8
 <0><7f0>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <7f1>   DW_AT_producer    : (indirect string, offset: 0xe7): GNU C17 8.3.0 -mstrict-align -mcmodel=medany -mabi=lp64 -march=rv64ima -g -O0 -ffreestanding -fno-stack-protector -fno-strict-aliasing -fno-jump-tables -ffunction-sections -fdata-sections -fno-PIE
    <7f5>   DW_AT_language    : 12	(ANSI C99)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x366): bios/shutdown.c
    <7fa>   DW_AT_comp_dir    : (indirect string, offset: 0xd): /serval/
    <7fe>   DW_AT_ranges      : 0xd0
    <802>   DW_AT_low_pc      : 0x0
    <80a>   DW_AT_stmt_list   : 0x48c
 <1><80e>: Abbrev Number: 2 (DW_TAG_base_type)
    <80f>   DW_AT_byte_size   : 4
    <810>   DW_AT_encoding    : 7	(unsigned)
    <811>   DW_AT_name        : (indirect string, offset: 0xc1): unsigned int
 <1><815>: Abbrev Number: 2 (DW_TAG_base_type)
    <816>   DW_AT_byte_size   : 1
    <817>   DW_AT_encoding    : 2	(boolean)
    <818>   DW_AT_name        : (indirect string, offset: 0xe1): _Bool
 <1><81c>: Abbrev Number: 2 (DW_TAG_base_type)
    <81d>   DW_AT_byte_size   : 1
    <81e>   DW_AT_encoding    : 8	(unsigned char)
    <81f>   DW_AT_name        : (indirect string, offset: 0xb2): char
 <1><823>: Abbrev Number: 3 (DW_TAG_const_type)
    <824>   DW_AT_type        : <0x81c>
 <1><828>: Abbrev Number: 2 (DW_TAG_base_type)
    <829>   DW_AT_byte_size   : 1
    <82a>   DW_AT_encoding    : 6	(signed char)
    <82b>   DW_AT_name        : (indirect string, offset: 0xab): signed char
 <1><82f>: Abbrev Number: 2 (DW_TAG_base_type)
    <830>   DW_AT_byte_size   : 1
    <831>   DW_AT_encoding    : 8	(unsigned char)
    <832>   DW_AT_name        : (indirect string, offset: 0xa9): unsigned char
 <1><836>: Abbrev Number: 2 (DW_TAG_base_type)
    <837>   DW_AT_byte_size   : 2
    <838>   DW_AT_encoding    : 5	(signed)
    <839>   DW_AT_name        : (indirect string, offset: 0x4b): short int
 <1><83d>: Abbrev Number: 2 (DW_TAG_base_type)
    <83e>   DW_AT_byte_size   : 2
    <83f>   DW_AT_encoding    : 7	(unsigned)
    <840>   DW_AT_name        : (indirect string, offset: 0xce): short unsigned int
 <1><844>: Abbrev Number: 4 (DW_TAG_base_type)
    <845>   DW_AT_byte_size   : 4
    <846>   DW_AT_encoding    : 5	(signed)
    <847>   DW_AT_name        : int
 <1><84b>: Abbrev Number: 2 (DW_TAG_base_type)
    <84c>   DW_AT_byte_size   : 8
    <84d>   DW_AT_encoding    : 5	(signed)
    <84e>   DW_AT_name        : (indirect string, offset: 0x7b): long int
 <1><852>: Abbrev Number: 2 (DW_TAG_base_type)
    <853>   DW_AT_byte_size   : 8
    <854>   DW_AT_encoding    : 7	(unsigned)
    <855>   DW_AT_name        : (indirect string, offset: 0xbc): long unsigned int
 <1><859>: Abbrev Number: 2 (DW_TAG_base_type)
    <85a>   DW_AT_byte_size   : 8
    <85b>   DW_AT_encoding    : 5	(signed)
    <85c>   DW_AT_name        : (indirect string, offset: 0x76): long long int
 <1><860>: Abbrev Number: 2 (DW_TAG_base_type)
    <861>   DW_AT_byte_size   : 8
    <862>   DW_AT_encoding    : 7	(unsigned)
    <863>   DW_AT_name        : (indirect string, offset: 0xb7): long long unsigned int
 <1><867>: Abbrev Number: 2 (DW_TAG_base_type)
    <868>   DW_AT_byte_size   : 16
    <869>   DW_AT_encoding    : 4	(float)
    <86a>   DW_AT_name        : (indirect string, offset: 0x9d): long double
 <1><86e>: Abbrev Number: 5 (DW_TAG_typedef)
    <86f>   DW_AT_name        : (indirect string, offset: 0x35d): uint32_t
    <873>   DW_AT_decl_file   : 5
    <874>   DW_AT_decl_line   : 52
    <875>   DW_AT_decl_column : 25
    <876>   DW_AT_type        : <0x80e>
 <1><87a>: Abbrev Number: 5 (DW_TAG_typedef)
    <87b>   DW_AT_name        : (indirect string, offset: 0x42): uint64_t
    <87f>   DW_AT_decl_file   : 5
    <880>   DW_AT_decl_line   : 55
    <881>   DW_AT_decl_column : 25
    <882>   DW_AT_type        : <0x852>
 <1><886>: Abbrev Number: 5 (DW_TAG_typedef)
    <887>   DW_AT_name        : (indirect string, offset: 0x326): uintptr_t
    <88b>   DW_AT_decl_file   : 5
    <88c>   DW_AT_decl_line   : 86
    <88d>   DW_AT_decl_column : 26
    <88e>   DW_AT_type        : <0x852>
 <1><892>: Abbrev Number: 5 (DW_TAG_typedef)
    <893>   DW_AT_name        : (indirect string, offset: 0x330): be32_t
    <897>   DW_AT_decl_file   : 6
    <898>   DW_AT_decl_line   : 16
    <899>   DW_AT_decl_column : 18
    <89a>   DW_AT_type        : <0x86e>
 <1><89e>: Abbrev Number: 3 (DW_TAG_const_type)
    <89f>   DW_AT_type        : <0x892>
 <1><8a3>: Abbrev Number: 6 (DW_TAG_array_type)
    <8a4>   DW_AT_type        : <0x823>
    <8a8>   DW_AT_sibling     : <0x8ae>
 <2><8ac>: Abbrev Number: 7 (DW_TAG_subrange_type)
 <2><8ad>: Abbrev Number: 0
 <1><8ae>: Abbrev Number: 3 (DW_TAG_const_type)
    <8af>   DW_AT_type        : <0x8a3>
 <1><8b3>: Abbrev Number: 8 (DW_TAG_variable)
    <8b4>   DW_AT_name        : (indirect string, offset: 0x1be): hex_asc
    <8b8>   DW_AT_decl_file   : 7
    <8b9>   DW_AT_decl_line   : 193
    <8ba>   DW_AT_decl_column : 19
    <8bb>   DW_AT_type        : <0x8ae>
    <8bf>   DW_AT_external    : 1
    <8bf>   DW_AT_declaration : 1
 <1><8bf>: Abbrev Number: 8 (DW_TAG_variable)
    <8c0>   DW_AT_name        : (indirect string, offset: 0x1d9): hex_asc_upper
    <8c4>   DW_AT_decl_file   : 7
    <8c5>   DW_AT_decl_line   : 204
    <8c6>   DW_AT_decl_column : 19
    <8c7>   DW_AT_type        : <0x8ae>
    <8cb>   DW_AT_external    : 1
    <8cb>   DW_AT_declaration : 1
 <1><8cb>: Abbrev Number: 9 (DW_TAG_subprogram)
    <8cc>   DW_AT_external    : 1
    <8cc>   DW_AT_name        : (indirect string, offset: 0x60): shutdown
    <8d0>   DW_AT_decl_file   : 4
    <8d1>   DW_AT_decl_line   : 25
    <8d2>   DW_AT_decl_column : 6
    <8d3>   DW_AT_prototyped  : 1
    <8d3>   DW_AT_noreturn    : 1
    <8d3>   DW_AT_low_pc      : 0x8000044c
    <8db>   DW_AT_high_pc     : 0x20
    <8e3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8e5>   DW_AT_GNU_all_tail_call_sites: 1
 <1><8e5>: Abbrev Number: 10 (DW_TAG_subprogram)
    <8e6>   DW_AT_external    : 1
    <8e6>   DW_AT_name        : (indirect string, offset: 0x318): test_shutdown
    <8ea>   DW_AT_decl_file   : 4
    <8eb>   DW_AT_decl_line   : 7
    <8ec>   DW_AT_decl_column : 6
    <8ed>   DW_AT_prototyped  : 1
    <8ed>   DW_AT_low_pc      : 0x800003b0
    <8f5>   DW_AT_high_pc     : 0x9c
    <8fd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8ff>   DW_AT_GNU_all_tail_call_sites: 1
    <8ff>   DW_AT_sibling     : <0x930>
 <2><903>: Abbrev Number: 11 (DW_TAG_variable)
    <904>   DW_AT_name        : np
    <907>   DW_AT_decl_file   : 4
    <908>   DW_AT_decl_line   : 9
    <909>   DW_AT_decl_column : 29
    <90a>   DW_AT_type        : <0x935>
    <90e>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><911>: Abbrev Number: 12 (DW_TAG_variable)
    <912>   DW_AT_name        : (indirect string, offset: 0xc7a): cell
    <916>   DW_AT_decl_file   : 4
    <917>   DW_AT_decl_line   : 10
    <918>   DW_AT_decl_column : 23
    <919>   DW_AT_type        : <0x93b>
    <91d>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><920>: Abbrev Number: 12 (DW_TAG_variable)
    <921>   DW_AT_name        : (indirect string, offset: 0x349): membase
    <925>   DW_AT_decl_file   : 4
    <926>   DW_AT_decl_line   : 11
    <927>   DW_AT_decl_column : 23
    <928>   DW_AT_type        : <0x941>
    <92c>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><92f>: Abbrev Number: 0
 <1><930>: Abbrev Number: 13 (DW_TAG_structure_type)
    <931>   DW_AT_name        : (indirect string, offset: 0x351): device_node
    <935>   DW_AT_declaration : 1
 <1><935>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <936>   DW_AT_byte_size   : 8
    <937>   DW_AT_type        : <0x930>
 <1><93b>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <93c>   DW_AT_byte_size   : 8
    <93d>   DW_AT_type        : <0x89e>
 <1><941>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <942>   DW_AT_byte_size   : 8
 <1><943>: Abbrev Number: 16 (DW_TAG_subprogram)
    <944>   DW_AT_name        : (indirect string, offset: 0x389): of_read_number
    <948>   DW_AT_decl_file   : 3
    <949>   DW_AT_decl_line   : 35
    <94a>   DW_AT_decl_column : 24
    <94b>   DW_AT_prototyped  : 1
    <94b>   DW_AT_type        : <0x87a>
    <94f>   DW_AT_low_pc      : 0x80000324
    <957>   DW_AT_high_pc     : 0x8c
    <95f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <961>   DW_AT_GNU_all_tail_call_sites: 1
    <961>   DW_AT_sibling     : <0x991>
 <2><965>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <966>   DW_AT_name        : (indirect string, offset: 0xc7a): cell
    <96a>   DW_AT_decl_file   : 3
    <96b>   DW_AT_decl_line   : 35
    <96c>   DW_AT_decl_column : 53
    <96d>   DW_AT_type        : <0x93b>
    <971>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><974>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <975>   DW_AT_name        : (indirect string, offset: 0x204): size
    <979>   DW_AT_decl_file   : 3
    <97a>   DW_AT_decl_line   : 35
    <97b>   DW_AT_decl_column : 63
    <97c>   DW_AT_type        : <0x844>
    <980>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><983>: Abbrev Number: 11 (DW_TAG_variable)
    <984>   DW_AT_name        : r
    <986>   DW_AT_decl_file   : 3
    <987>   DW_AT_decl_line   : 37
    <988>   DW_AT_decl_column : 18
    <989>   DW_AT_type        : <0x87a>
    <98d>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><990>: Abbrev Number: 0
 <1><991>: Abbrev Number: 18 (DW_TAG_subprogram)
    <992>   DW_AT_name        : (indirect string, offset: 0x376): wait_for_interrupt
    <996>   DW_AT_decl_file   : 2
    <997>   DW_AT_decl_line   : 11
    <998>   DW_AT_decl_column : 20
    <999>   DW_AT_prototyped  : 1
    <999>   DW_AT_low_pc      : 0x80000304
    <9a1>   DW_AT_high_pc     : 0x20
    <9a9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9ab>   DW_AT_GNU_all_call_sites: 1
 <1><9ab>: Abbrev Number: 19 (DW_TAG_subprogram)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x33c): __raw_writel
    <9b0>   DW_AT_decl_file   : 1
    <9b1>   DW_AT_decl_line   : 49
    <9b2>   DW_AT_decl_column : 20
    <9b3>   DW_AT_prototyped  : 1
    <9b3>   DW_AT_low_pc      : 0x800002d0
    <9bb>   DW_AT_high_pc     : 0x34
    <9c3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9c5>   DW_AT_GNU_all_call_sites: 1
    <9c5>   DW_AT_sibling     : <0x9e8>
 <2><9c9>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <9ca>   DW_AT_name        : val
    <9ce>   DW_AT_decl_file   : 1
    <9cf>   DW_AT_decl_line   : 49
    <9d0>   DW_AT_decl_column : 42
    <9d1>   DW_AT_type        : <0x86e>
    <9d5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9d8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x337): addr
    <9dd>   DW_AT_decl_file   : 1
    <9de>   DW_AT_decl_line   : 49
    <9df>   DW_AT_decl_column : 70
    <9e0>   DW_AT_type        : <0x9e8>
    <9e4>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><9e7>: Abbrev Number: 0
 <1><9e8>: Abbrev Number: 14 (DW_TAG_pointer_type)
    <9e9>   DW_AT_byte_size   : 8
    <9ea>   DW_AT_type        : <0x9ee>
 <1><9ee>: Abbrev Number: 21 (DW_TAG_volatile_type)
 <1><9ef>: Abbrev Number: 0
  Compilation Unit @ offset 0x9f0:
   Length:        0x1af (32-bit)
   Version:       4
   Abbrev Offset: 0x42e
   Pointer Size:  8
 <0><9fb>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <9fc>   DW_AT_producer    : (indirect string, offset: 0xe7): GNU C17 8.3.0 -mstrict-align -mcmodel=medany -mabi=lp64 -march=rv64ima -g -O0 -ffreestanding -fno-stack-protector -fno-strict-aliasing -fno-jump-tables -ffunction-sections -fdata-sections -fno-PIE
    <a00>   DW_AT_language    : 12	(ANSI C99)
    <a01>   DW_AT_name        : (indirect string, offset: 0x398): bios/traps.c
    <a05>   DW_AT_comp_dir    : (indirect string, offset: 0xd): /serval/
    <a09>   DW_AT_ranges      : 0x130
    <a0d>   DW_AT_low_pc      : 0x0
    <a15>   DW_AT_stmt_list   : 0x697
 <1><a19>: Abbrev Number: 2 (DW_TAG_base_type)
    <a1a>   DW_AT_byte_size   : 1
    <a1b>   DW_AT_encoding    : 6	(signed char)
    <a1c>   DW_AT_name        : (indirect string, offset: 0xab): signed char
 <1><a20>: Abbrev Number: 2 (DW_TAG_base_type)
    <a21>   DW_AT_byte_size   : 2
    <a22>   DW_AT_encoding    : 5	(signed)
    <a23>   DW_AT_name        : (indirect string, offset: 0x4b): short int
 <1><a27>: Abbrev Number: 3 (DW_TAG_base_type)
    <a28>   DW_AT_byte_size   : 4
    <a29>   DW_AT_encoding    : 5	(signed)
    <a2a>   DW_AT_name        : int
 <1><a2e>: Abbrev Number: 2 (DW_TAG_base_type)
    <a2f>   DW_AT_byte_size   : 8
    <a30>   DW_AT_encoding    : 5	(signed)
    <a31>   DW_AT_name        : (indirect string, offset: 0x7b): long int
 <1><a35>: Abbrev Number: 2 (DW_TAG_base_type)
    <a36>   DW_AT_byte_size   : 1
    <a37>   DW_AT_encoding    : 8	(unsigned char)
    <a38>   DW_AT_name        : (indirect string, offset: 0xa9): unsigned char
 <1><a3c>: Abbrev Number: 2 (DW_TAG_base_type)
    <a3d>   DW_AT_byte_size   : 2
    <a3e>   DW_AT_encoding    : 7	(unsigned)
    <a3f>   DW_AT_name        : (indirect string, offset: 0xce): short unsigned int
 <1><a43>: Abbrev Number: 2 (DW_TAG_base_type)
    <a44>   DW_AT_byte_size   : 4
    <a45>   DW_AT_encoding    : 7	(unsigned)
    <a46>   DW_AT_name        : (indirect string, offset: 0xc1): unsigned int
 <1><a4a>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4b>   DW_AT_name        : (indirect string, offset: 0x42): uint64_t
    <a4f>   DW_AT_decl_file   : 3
    <a50>   DW_AT_decl_line   : 55
    <a51>   DW_AT_decl_column : 25
    <a52>   DW_AT_type        : <0xa56>
 <1><a56>: Abbrev Number: 2 (DW_TAG_base_type)
    <a57>   DW_AT_byte_size   : 8
    <a58>   DW_AT_encoding    : 7	(unsigned)
    <a59>   DW_AT_name        : (indirect string, offset: 0xbc): long unsigned int
 <1><a5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <a5e>   DW_AT_byte_size   : 1
    <a5f>   DW_AT_encoding    : 2	(boolean)
    <a60>   DW_AT_name        : (indirect string, offset: 0xe1): _Bool
 <1><a64>: Abbrev Number: 2 (DW_TAG_base_type)
    <a65>   DW_AT_byte_size   : 1
    <a66>   DW_AT_encoding    : 8	(unsigned char)
    <a67>   DW_AT_name        : (indirect string, offset: 0xb2): char
 <1><a6b>: Abbrev Number: 5 (DW_TAG_const_type)
    <a6c>   DW_AT_type        : <0xa64>
 <1><a70>: Abbrev Number: 2 (DW_TAG_base_type)
    <a71>   DW_AT_byte_size   : 8
    <a72>   DW_AT_encoding    : 5	(signed)
    <a73>   DW_AT_name        : (indirect string, offset: 0x76): long long int
 <1><a77>: Abbrev Number: 2 (DW_TAG_base_type)
    <a78>   DW_AT_byte_size   : 8
    <a79>   DW_AT_encoding    : 7	(unsigned)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xb7): long long unsigned int
 <1><a7e>: Abbrev Number: 2 (DW_TAG_base_type)
    <a7f>   DW_AT_byte_size   : 16
    <a80>   DW_AT_encoding    : 4	(float)
    <a81>   DW_AT_name        : (indirect string, offset: 0x9d): long double
 <1><a85>: Abbrev Number: 4 (DW_TAG_typedef)
    <a86>   DW_AT_name        : (indirect string, offset: 0x2f3): phys_addr_t
    <a8a>   DW_AT_decl_file   : 4
    <a8b>   DW_AT_decl_line   : 184
    <a8c>   DW_AT_decl_column : 25
    <a8d>   DW_AT_type        : <0xa4a>
 <1><a91>: Abbrev Number: 6 (DW_TAG_array_type)
    <a92>   DW_AT_type        : <0xa6b>
    <a96>   DW_AT_sibling     : <0xa9c>
 <2><a9a>: Abbrev Number: 7 (DW_TAG_subrange_type)
 <2><a9b>: Abbrev Number: 0
 <1><a9c>: Abbrev Number: 5 (DW_TAG_const_type)
    <a9d>   DW_AT_type        : <0xa91>
 <1><aa1>: Abbrev Number: 8 (DW_TAG_variable)
    <aa2>   DW_AT_name        : (indirect string, offset: 0x1be): hex_asc
    <aa6>   DW_AT_decl_file   : 4
    <aa7>   DW_AT_decl_line   : 193
    <aa8>   DW_AT_decl_column : 19
    <aa9>   DW_AT_type        : <0xa9c>
    <aad>   DW_AT_external    : 1
    <aad>   DW_AT_declaration : 1
 <1><aad>: Abbrev Number: 8 (DW_TAG_variable)
    <aae>   DW_AT_name        : (indirect string, offset: 0x1d9): hex_asc_upper
    <ab2>   DW_AT_decl_file   : 4
    <ab3>   DW_AT_decl_line   : 204
    <ab4>   DW_AT_decl_column : 19
    <ab5>   DW_AT_type        : <0xa9c>
    <ab9>   DW_AT_external    : 1
    <ab9>   DW_AT_declaration : 1
 <1><ab9>: Abbrev Number: 8 (DW_TAG_variable)
    <aba>   DW_AT_name        : (indirect string, offset: 0x21f): kernel_dtb
    <abe>   DW_AT_decl_file   : 5
    <abf>   DW_AT_decl_line   : 6
    <ac0>   DW_AT_decl_column : 20
    <ac1>   DW_AT_type        : <0xa85>
    <ac5>   DW_AT_external    : 1
    <ac5>   DW_AT_declaration : 1
 <1><ac5>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ac6>   DW_AT_byte_size   : 8
    <ac7>   DW_AT_type        : <0xa6b>
 <1><acb>: Abbrev Number: 10 (DW_TAG_subprogram)
    <acc>   DW_AT_external    : 1
    <acc>   DW_AT_name        : (indirect string, offset: 0x3a5): show_sys_regs
    <ad0>   DW_AT_decl_file   : 2
    <ad1>   DW_AT_decl_line   : 7
    <ad2>   DW_AT_decl_column : 6
    <ad3>   DW_AT_prototyped  : 1
    <ad3>   DW_AT_low_pc      : 0x800004a8
    <adb>   DW_AT_high_pc     : 0x94
    <ae3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ae5>   DW_AT_GNU_all_tail_call_sites: 1
    <ae5>   DW_AT_sibling     : <0xb76>
 <2><ae9>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <aea>   DW_AT_low_pc      : 0x800004b8
    <af2>   DW_AT_high_pc     : 0xc
    <afa>   DW_AT_sibling     : <0xb0d>
 <3><afe>: Abbrev Number: 12 (DW_TAG_variable)
    <aff>   DW_AT_name        : __v
    <b03>   DW_AT_decl_file   : 2
    <b04>   DW_AT_decl_line   : 9
    <b05>   DW_AT_decl_column : 44
    <b06>   DW_AT_type        : <0xa56>
    <b0a>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (ra))
 <3><b0c>: Abbrev Number: 0
 <2><b0d>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <b0e>   DW_AT_low_pc      : 0x800004d4
    <b16>   DW_AT_high_pc     : 0xc
    <b1e>   DW_AT_sibling     : <0xb31>
 <3><b22>: Abbrev Number: 12 (DW_TAG_variable)
    <b23>   DW_AT_name        : __v
    <b27>   DW_AT_decl_file   : 2
    <b28>   DW_AT_decl_line   : 10
    <b29>   DW_AT_decl_column : 44
    <b2a>   DW_AT_type        : <0xa56>
    <b2e>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (ra))
 <3><b30>: Abbrev Number: 0
 <2><b31>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <b32>   DW_AT_low_pc      : 0x800004f0
    <b3a>   DW_AT_high_pc     : 0xc
    <b42>   DW_AT_sibling     : <0xb55>
 <3><b46>: Abbrev Number: 12 (DW_TAG_variable)
    <b47>   DW_AT_name        : __v
    <b4b>   DW_AT_decl_file   : 2
    <b4c>   DW_AT_decl_line   : 11
    <b4d>   DW_AT_decl_column : 44
    <b4e>   DW_AT_type        : <0xa56>
    <b52>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (ra))
 <3><b54>: Abbrev Number: 0
 <2><b55>: Abbrev Number: 13 (DW_TAG_lexical_block)
    <b56>   DW_AT_low_pc      : 0x8000050c
    <b5e>   DW_AT_high_pc     : 0xc
 <3><b66>: Abbrev Number: 12 (DW_TAG_variable)
    <b67>   DW_AT_name        : __v
    <b6b>   DW_AT_decl_file   : 2
    <b6c>   DW_AT_decl_line   : 12
    <b6d>   DW_AT_decl_column : 44
    <b6e>   DW_AT_type        : <0xa56>
    <b72>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (ra))
 <3><b74>: Abbrev Number: 0
 <2><b75>: Abbrev Number: 0
 <1><b76>: Abbrev Number: 14 (DW_TAG_subprogram)
    <b77>   DW_AT_name        : (indirect string, offset: 0x2a4): printk_unused
    <b7b>   DW_AT_decl_file   : 1
    <b7c>   DW_AT_decl_line   : 32
    <b7d>   DW_AT_decl_column : 36
    <b7e>   DW_AT_prototyped  : 1
    <b7e>   DW_AT_low_pc      : 0x8000046c
    <b86>   DW_AT_high_pc     : 0x3c
    <b8e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b90>   DW_AT_GNU_all_call_sites: 1
 <2><b90>: Abbrev Number: 15 (DW_TAG_formal_parameter)
    <b91>   DW_AT_name        : fmt
    <b95>   DW_AT_decl_file   : 1
    <b96>   DW_AT_decl_line   : 32
    <b97>   DW_AT_decl_column : 62
    <b98>   DW_AT_type        : <0xac5>
    <b9c>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><ba0>: Abbrev Number: 16 (DW_TAG_unspecified_parameters)
 <2><ba1>: Abbrev Number: 0
 <1><ba2>: Abbrev Number: 0
  Compilation Unit @ offset 0xba3:
   Length:        0xd2 (32-bit)
   Version:       4
   Abbrev Offset: 0x507
   Pointer Size:  8
 <0><bae>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <baf>   DW_AT_producer    : (indirect string, offset: 0xe7): GNU C17 8.3.0 -mstrict-align -mcmodel=medany -mabi=lp64 -march=rv64ima -g -O0 -ffreestanding -fno-stack-protector -fno-strict-aliasing -fno-jump-tables -ffunction-sections -fdata-sections -fno-PIE
    <bb3>   DW_AT_language    : 12	(ANSI C99)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x3c9): kernel/bswap.c
    <bb8>   DW_AT_comp_dir    : (indirect string, offset: 0xd): /serval/
    <bbc>   DW_AT_ranges      : 0x160
    <bc0>   DW_AT_low_pc      : 0x0
    <bc8>   DW_AT_stmt_list   : 0x7b9
 <1><bcc>: Abbrev Number: 2 (DW_TAG_base_type)
    <bcd>   DW_AT_byte_size   : 1
    <bce>   DW_AT_encoding    : 6	(signed char)
    <bcf>   DW_AT_name        : (indirect string, offset: 0xab): signed char
 <1><bd3>: Abbrev Number: 2 (DW_TAG_base_type)
    <bd4>   DW_AT_byte_size   : 2
    <bd5>   DW_AT_encoding    : 5	(signed)
    <bd6>   DW_AT_name        : (indirect string, offset: 0x4b): short int
 <1><bda>: Abbrev Number: 3 (DW_TAG_base_type)
    <bdb>   DW_AT_byte_size   : 4
    <bdc>   DW_AT_encoding    : 5	(signed)
    <bdd>   DW_AT_name        : int
 <1><be1>: Abbrev Number: 2 (DW_TAG_base_type)
    <be2>   DW_AT_byte_size   : 8
    <be3>   DW_AT_encoding    : 5	(signed)
    <be4>   DW_AT_name        : (indirect string, offset: 0x7b): long int
 <1><be8>: Abbrev Number: 2 (DW_TAG_base_type)
    <be9>   DW_AT_byte_size   : 1
    <bea>   DW_AT_encoding    : 8	(unsigned char)
    <beb>   DW_AT_name        : (indirect string, offset: 0xa9): unsigned char
 <1><bef>: Abbrev Number: 2 (DW_TAG_base_type)
    <bf0>   DW_AT_byte_size   : 2
    <bf1>   DW_AT_encoding    : 7	(unsigned)
    <bf2>   DW_AT_name        : (indirect string, offset: 0xce): short unsigned int
 <1><bf6>: Abbrev Number: 4 (DW_TAG_typedef)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x35d): uint32_t
    <bfb>   DW_AT_decl_file   : 2
    <bfc>   DW_AT_decl_line   : 52
    <bfd>   DW_AT_decl_column : 25
    <bfe>   DW_AT_type        : <0xc02>
 <1><c02>: Abbrev Number: 2 (DW_TAG_base_type)
    <c03>   DW_AT_byte_size   : 4
    <c04>   DW_AT_encoding    : 7	(unsigned)
    <c05>   DW_AT_name        : (indirect string, offset: 0xc1): unsigned int
 <1><c09>: Abbrev Number: 4 (DW_TAG_typedef)
    <c0a>   DW_AT_name        : (indirect string, offset: 0x42): uint64_t
    <c0e>   DW_AT_decl_file   : 2
    <c0f>   DW_AT_decl_line   : 55
    <c10>   DW_AT_decl_column : 25
    <c11>   DW_AT_type        : <0xc15>
 <1><c15>: Abbrev Number: 2 (DW_TAG_base_type)
    <c16>   DW_AT_byte_size   : 8
    <c17>   DW_AT_encoding    : 7	(unsigned)
    <c18>   DW_AT_name        : (indirect string, offset: 0xbc): long unsigned int
 <1><c1c>: Abbrev Number: 5 (DW_TAG_subprogram)
    <c1d>   DW_AT_external    : 1
    <c1d>   DW_AT_name        : (indirect string, offset: 0x3be): __bswapdi2
    <c21>   DW_AT_decl_file   : 1
    <c22>   DW_AT_decl_line   : 11
    <c23>   DW_AT_decl_column : 10
    <c24>   DW_AT_prototyped  : 1
    <c24>   DW_AT_type        : <0xc09>
    <c28>   DW_AT_low_pc      : 0x0
    <c30>   DW_AT_high_pc     : 0x0
    <c38>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c3a>   DW_AT_GNU_all_call_sites: 1
    <c3a>   DW_AT_sibling     : <0xc4c>
 <2><c3e>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c3f>   DW_AT_name        : u
    <c41>   DW_AT_decl_file   : 1
    <c42>   DW_AT_decl_line   : 11
    <c43>   DW_AT_decl_column : 30
    <c44>   DW_AT_type        : <0xc09>
    <c48>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c4b>: Abbrev Number: 0
 <1><c4c>: Abbrev Number: 7 (DW_TAG_subprogram)
    <c4d>   DW_AT_external    : 1
    <c4d>   DW_AT_name        : (indirect string, offset: 0x3b3): __bswapsi2
    <c51>   DW_AT_decl_file   : 1
    <c52>   DW_AT_decl_line   : 3
    <c53>   DW_AT_decl_column : 10
    <c54>   DW_AT_prototyped  : 1
    <c54>   DW_AT_type        : <0xbf6>
    <c58>   DW_AT_low_pc      : 0x8000053c
    <c60>   DW_AT_high_pc     : 0x90
    <c68>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c6a>   DW_AT_GNU_all_call_sites: 1
 <2><c6a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <c6b>   DW_AT_name        : u
    <c6d>   DW_AT_decl_file   : 1
    <c6e>   DW_AT_decl_line   : 3
    <c6f>   DW_AT_decl_column : 30
    <c70>   DW_AT_type        : <0xbf6>
    <c74>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c77>: Abbrev Number: 0
 <1><c78>: Abbrev Number: 0
  Compilation Unit @ offset 0xc79:
   Length:        0x2cd (32-bit)
   Version:       4
   Abbrev Offset: 0x58b
   Pointer Size:  8
 <0><c84>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c85>   DW_AT_producer    : (indirect string, offset: 0xe7): GNU C17 8.3.0 -mstrict-align -mcmodel=medany -mabi=lp64 -march=rv64ima -g -O0 -ffreestanding -fno-stack-protector -fno-strict-aliasing -fno-jump-tables -ffunction-sections -fdata-sections -fno-PIE
    <c89>   DW_AT_language    : 12	(ANSI C99)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x41d): kernel/dumpstack.c
    <c8e>   DW_AT_comp_dir    : (indirect string, offset: 0xd): /serval/
    <c92>   DW_AT_ranges      : 0x190
    <c96>   DW_AT_low_pc      : 0x0
    <c9e>   DW_AT_stmt_list   : 0x911
 <1><ca2>: Abbrev Number: 2 (DW_TAG_base_type)
    <ca3>   DW_AT_byte_size   : 8
    <ca4>   DW_AT_encoding    : 7	(unsigned)
    <ca5>   DW_AT_name        : (indirect string, offset: 0xbc): long unsigned int
 <1><ca9>: Abbrev Number: 3 (DW_TAG_const_type)
    <caa>   DW_AT_type        : <0xca2>
 <1><cae>: Abbrev Number: 2 (DW_TAG_base_type)
    <caf>   DW_AT_byte_size   : 1
    <cb0>   DW_AT_encoding    : 6	(signed char)
    <cb1>   DW_AT_name        : (indirect string, offset: 0xab): signed char
 <1><cb5>: Abbrev Number: 2 (DW_TAG_base_type)
    <cb6>   DW_AT_byte_size   : 2
    <cb7>   DW_AT_encoding    : 5	(signed)
    <cb8>   DW_AT_name        : (indirect string, offset: 0x4b): short int
 <1><cbc>: Abbrev Number: 4 (DW_TAG_base_type)
    <cbd>   DW_AT_byte_size   : 4
    <cbe>   DW_AT_encoding    : 5	(signed)
    <cbf>   DW_AT_name        : int
 <1><cc3>: Abbrev Number: 2 (DW_TAG_base_type)
    <cc4>   DW_AT_byte_size   : 8
    <cc5>   DW_AT_encoding    : 5	(signed)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x7b): long int
 <1><cca>: Abbrev Number: 2 (DW_TAG_base_type)
    <ccb>   DW_AT_byte_size   : 1
    <ccc>   DW_AT_encoding    : 8	(unsigned char)
    <ccd>   DW_AT_name        : (indirect string, offset: 0xa9): unsigned char
 <1><cd1>: Abbrev Number: 2 (DW_TAG_base_type)
    <cd2>   DW_AT_byte_size   : 2
    <cd3>   DW_AT_encoding    : 7	(unsigned)
    <cd4>   DW_AT_name        : (indirect string, offset: 0xce): short unsigned int
 <1><cd8>: Abbrev Number: 2 (DW_TAG_base_type)
    <cd9>   DW_AT_byte_size   : 4
    <cda>   DW_AT_encoding    : 7	(unsigned)
    <cdb>   DW_AT_name        : (indirect string, offset: 0xc1): unsigned int
 <1><cdf>: Abbrev Number: 5 (DW_TAG_typedef)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x326): uintptr_t
    <ce4>   DW_AT_decl_file   : 5
    <ce5>   DW_AT_decl_line   : 86
    <ce6>   DW_AT_decl_column : 26
    <ce7>   DW_AT_type        : <0xca2>
 <1><ceb>: Abbrev Number: 6 (DW_TAG_array_type)
    <cec>   DW_AT_type        : <0xcf6>
    <cf0>   DW_AT_sibling     : <0xcf6>
 <2><cf4>: Abbrev Number: 7 (DW_TAG_subrange_type)
 <2><cf5>: Abbrev Number: 0
 <1><cf6>: Abbrev Number: 2 (DW_TAG_base_type)
    <cf7>   DW_AT_byte_size   : 1
    <cf8>   DW_AT_encoding    : 8	(unsigned char)
    <cf9>   DW_AT_name        : (indirect string, offset: 0xb2): char
 <1><cfd>: Abbrev Number: 3 (DW_TAG_const_type)
    <cfe>   DW_AT_type        : <0xcf6>
 <1><d02>: Abbrev Number: 8 (DW_TAG_variable)
    <d03>   DW_AT_name        : (indirect string, offset: 0x1f7): _stext
    <d07>   DW_AT_decl_file   : 3
    <d08>   DW_AT_decl_line   : 3
    <d09>   DW_AT_decl_column : 13
    <d0a>   DW_AT_type        : <0xceb>
    <d0e>   DW_AT_external    : 1
    <d0e>   DW_AT_declaration : 1
 <1><d0e>: Abbrev Number: 8 (DW_TAG_variable)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x2b2): _etext
    <d13>   DW_AT_decl_file   : 3
    <d14>   DW_AT_decl_line   : 3
    <d15>   DW_AT_decl_column : 23
    <d16>   DW_AT_type        : <0xceb>
    <d1a>   DW_AT_external    : 1
    <d1a>   DW_AT_declaration : 1
 <1><d1a>: Abbrev Number: 8 (DW_TAG_variable)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x311): _sdata
    <d1f>   DW_AT_decl_file   : 3
    <d20>   DW_AT_decl_line   : 4
    <d21>   DW_AT_decl_column : 13
    <d22>   DW_AT_type        : <0xceb>
    <d26>   DW_AT_external    : 1
    <d26>   DW_AT_declaration : 1
 <1><d26>: Abbrev Number: 8 (DW_TAG_variable)
    <d27>   DW_AT_name        : (indirect string, offset: 0x209): _edata
    <d2b>   DW_AT_decl_file   : 3
    <d2c>   DW_AT_decl_line   : 4
    <d2d>   DW_AT_decl_column : 23
    <d2e>   DW_AT_type        : <0xceb>
    <d32>   DW_AT_external    : 1
    <d32>   DW_AT_declaration : 1
 <1><d32>: Abbrev Number: 8 (DW_TAG_variable)
    <d33>   DW_AT_name        : (indirect string, offset: 0x218): _start
    <d37>   DW_AT_decl_file   : 3
    <d38>   DW_AT_decl_line   : 5
    <d39>   DW_AT_decl_column : 13
    <d3a>   DW_AT_type        : <0xceb>
    <d3e>   DW_AT_external    : 1
    <d3e>   DW_AT_declaration : 1
 <1><d3e>: Abbrev Number: 8 (DW_TAG_variable)
    <d3f>   DW_AT_name        : (indirect string, offset: 0x2cf): _end
    <d43>   DW_AT_decl_file   : 3
    <d44>   DW_AT_decl_line   : 5
    <d45>   DW_AT_decl_column : 23
    <d46>   DW_AT_type        : <0xceb>
    <d4a>   DW_AT_external    : 1
    <d4a>   DW_AT_declaration : 1
 <1><d4a>: Abbrev Number: 8 (DW_TAG_variable)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x289): __bss_start
    <d4f>   DW_AT_decl_file   : 3
    <d50>   DW_AT_decl_line   : 6
    <d51>   DW_AT_decl_column : 13
    <d52>   DW_AT_type        : <0xceb>
    <d56>   DW_AT_external    : 1
    <d56>   DW_AT_declaration : 1
 <1><d56>: Abbrev Number: 8 (DW_TAG_variable)
    <d57>   DW_AT_name        : (indirect string, offset: 0x25f): __bss_end
    <d5b>   DW_AT_decl_file   : 3
    <d5c>   DW_AT_decl_line   : 6
    <d5d>   DW_AT_decl_column : 28
    <d5e>   DW_AT_type        : <0xceb>
    <d62>   DW_AT_external    : 1
    <d62>   DW_AT_declaration : 1
 <1><d62>: Abbrev Number: 8 (DW_TAG_variable)
    <d63>   DW_AT_name        : (indirect string, offset: 0x210): _payload_start
    <d67>   DW_AT_decl_file   : 3
    <d68>   DW_AT_decl_line   : 7
    <d69>   DW_AT_decl_column : 13
    <d6a>   DW_AT_type        : <0xceb>
    <d6e>   DW_AT_external    : 1
    <d6e>   DW_AT_declaration : 1
 <1><d6e>: Abbrev Number: 8 (DW_TAG_variable)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x2c7): _payload_end
    <d73>   DW_AT_decl_file   : 3
    <d74>   DW_AT_decl_line   : 7
    <d75>   DW_AT_decl_column : 31
    <d76>   DW_AT_type        : <0xceb>
    <d7a>   DW_AT_external    : 1
    <d7a>   DW_AT_declaration : 1
 <1><d7a>: Abbrev Number: 2 (DW_TAG_base_type)
    <d7b>   DW_AT_byte_size   : 1
    <d7c>   DW_AT_encoding    : 2	(boolean)
    <d7d>   DW_AT_name        : (indirect string, offset: 0xe1): _Bool
 <1><d81>: Abbrev Number: 2 (DW_TAG_base_type)
    <d82>   DW_AT_byte_size   : 8
    <d83>   DW_AT_encoding    : 5	(signed)
    <d84>   DW_AT_name        : (indirect string, offset: 0x76): long long int
 <1><d88>: Abbrev Number: 2 (DW_TAG_base_type)
    <d89>   DW_AT_byte_size   : 8
    <d8a>   DW_AT_encoding    : 7	(unsigned)
    <d8b>   DW_AT_name        : (indirect string, offset: 0xb7): long long unsigned int
 <1><d8f>: Abbrev Number: 2 (DW_TAG_base_type)
    <d90>   DW_AT_byte_size   : 16
    <d91>   DW_AT_encoding    : 4	(float)
    <d92>   DW_AT_name        : (indirect string, offset: 0x9d): long double
 <1><d96>: Abbrev Number: 6 (DW_TAG_array_type)
    <d97>   DW_AT_type        : <0xcfd>
    <d9b>   DW_AT_sibling     : <0xda1>
 <2><d9f>: Abbrev Number: 7 (DW_TAG_subrange_type)
 <2><da0>: Abbrev Number: 0
 <1><da1>: Abbrev Number: 3 (DW_TAG_const_type)
    <da2>   DW_AT_type        : <0xd96>
 <1><da6>: Abbrev Number: 8 (DW_TAG_variable)
    <da7>   DW_AT_name        : (indirect string, offset: 0x1be): hex_asc
    <dab>   DW_AT_decl_file   : 4
    <dac>   DW_AT_decl_line   : 193
    <dad>   DW_AT_decl_column : 19
    <dae>   DW_AT_type        : <0xda1>
    <db2>   DW_AT_external    : 1
    <db2>   DW_AT_declaration : 1
 <1><db2>: Abbrev Number: 8 (DW_TAG_variable)
    <db3>   DW_AT_name        : (indirect string, offset: 0x1d9): hex_asc_upper
    <db7>   DW_AT_decl_file   : 4
    <db8>   DW_AT_decl_line   : 204
    <db9>   DW_AT_decl_column : 19
    <dba>   DW_AT_type        : <0xda1>
    <dbe>   DW_AT_external    : 1
    <dbe>   DW_AT_declaration : 1
 <1><dbe>: Abbrev Number: 9 (DW_TAG_subprogram)
    <dbf>   DW_AT_external    : 1
    <dbf>   DW_AT_name        : (indirect string, offset: 0x412): dump_stack
    <dc3>   DW_AT_decl_file   : 2
    <dc4>   DW_AT_decl_line   : 51
    <dc5>   DW_AT_decl_column : 6
    <dc6>   DW_AT_prototyped  : 1
    <dc6>   DW_AT_low_pc      : 0x80000788
    <dce>   DW_AT_high_pc     : 0x40
    <dd6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dd8>   DW_AT_GNU_all_tail_call_sites: 1
 <1><dd8>: Abbrev Number: 10 (DW_TAG_subprogram)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x430): print_trace_address
    <ddd>   DW_AT_decl_file   : 2
    <dde>   DW_AT_decl_line   : 45
    <ddf>   DW_AT_decl_column : 13
    <de0>   DW_AT_prototyped  : 1
    <de0>   DW_AT_type        : <0xd7a>
    <de4>   DW_AT_low_pc      : 0x80000744
    <dec>   DW_AT_high_pc     : 0x44
    <df4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <df6>   DW_AT_GNU_all_tail_call_sites: 1
    <df6>   DW_AT_sibling     : <0xe18>
 <2><dfa>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <dfb>   DW_AT_name        : pc
    <dfe>   DW_AT_decl_file   : 2
    <dff>   DW_AT_decl_line   : 45
    <e00>   DW_AT_decl_column : 47
    <e01>   DW_AT_type        : <0xca2>
    <e05>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><e08>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e09>   DW_AT_name        : arg
    <e0d>   DW_AT_decl_file   : 2
    <e0e>   DW_AT_decl_line   : 45
    <e0f>   DW_AT_decl_column : 57
    <e10>   DW_AT_type        : <0xe18>
    <e14>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><e17>: Abbrev Number: 0
 <1><e18>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <e19>   DW_AT_byte_size   : 8
 <1><e1a>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e1b>   DW_AT_name        : (indirect string, offset: 0x3d8): walk_stackframe
    <e1f>   DW_AT_decl_file   : 2
    <e20>   DW_AT_decl_line   : 25
    <e21>   DW_AT_decl_column : 13
    <e22>   DW_AT_prototyped  : 1
    <e22>   DW_AT_low_pc      : 0x80000694
    <e2a>   DW_AT_high_pc     : 0xb0
    <e32>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e34>   DW_AT_GNU_all_tail_call_sites: 1
    <e34>   DW_AT_sibling     : <0xe8f>
 <2><e38>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e39>   DW_AT_name        : fn
    <e3c>   DW_AT_decl_file   : 2
    <e3d>   DW_AT_decl_line   : 25
    <e3e>   DW_AT_decl_column : 36
    <e3f>   DW_AT_type        : <0xea3>
    <e43>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><e46>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <e47>   DW_AT_name        : arg
    <e4b>   DW_AT_decl_file   : 2
    <e4c>   DW_AT_decl_line   : 25
    <e4d>   DW_AT_decl_column : 70
    <e4e>   DW_AT_type        : <0xe18>
    <e52>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><e55>: Abbrev Number: 14 (DW_TAG_variable)
    <e56>   DW_AT_name        : sp
    <e59>   DW_AT_decl_file   : 2
    <e5a>   DW_AT_decl_line   : 27
    <e5b>   DW_AT_decl_column : 23
    <e5c>   DW_AT_type        : <0xca2>
    <e60>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><e63>: Abbrev Number: 14 (DW_TAG_variable)
    <e64>   DW_AT_name        : pc
    <e67>   DW_AT_decl_file   : 2
    <e68>   DW_AT_decl_line   : 27
    <e69>   DW_AT_decl_column : 27
    <e6a>   DW_AT_type        : <0xca2>
    <e6e>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><e71>: Abbrev Number: 14 (DW_TAG_variable)
    <e72>   DW_AT_name        : ksp
    <e76>   DW_AT_decl_file   : 2
    <e77>   DW_AT_decl_line   : 28
    <e78>   DW_AT_decl_column : 24
    <e79>   DW_AT_type        : <0xea9>
    <e7d>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><e80>: Abbrev Number: 15 (DW_TAG_variable)
    <e81>   DW_AT_name        : (indirect string, offset: 0x3fc): current_sp
    <e85>   DW_AT_decl_file   : 2
    <e86>   DW_AT_decl_line   : 29
    <e87>   DW_AT_decl_column : 38
    <e88>   DW_AT_type        : <0xca9>
    <e8c>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (sp))
 <2><e8e>: Abbrev Number: 0
 <1><e8f>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <e90>   DW_AT_prototyped  : 1
    <e90>   DW_AT_type        : <0xd7a>
    <e94>   DW_AT_sibling     : <0xea3>
 <2><e98>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e99>   DW_AT_type        : <0xca2>
 <2><e9d>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e9e>   DW_AT_type        : <0xe18>
 <2><ea2>: Abbrev Number: 0
 <1><ea3>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <ea4>   DW_AT_byte_size   : 8
    <ea5>   DW_AT_type        : <0xe8f>
 <1><ea9>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <eaa>   DW_AT_byte_size   : 8
    <eab>   DW_AT_type        : <0xca2>
 <1><eaf>: Abbrev Number: 19 (DW_TAG_subprogram)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x3e8): kernel_text_address
    <eb4>   DW_AT_decl_file   : 2
    <eb5>   DW_AT_decl_line   : 15
    <eb6>   DW_AT_decl_column : 13
    <eb7>   DW_AT_prototyped  : 1
    <eb7>   DW_AT_type        : <0xd7a>
    <ebb>   DW_AT_low_pc      : 0x80000648
    <ec3>   DW_AT_high_pc     : 0x4c
    <ecb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ecd>   DW_AT_GNU_all_call_sites: 1
    <ecd>   DW_AT_sibling     : <0xee1>
 <2><ed1>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x337): addr
    <ed6>   DW_AT_decl_file   : 2
    <ed7>   DW_AT_decl_line   : 15
    <ed8>   DW_AT_decl_column : 47
    <ed9>   DW_AT_type        : <0xca2>
    <edd>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><ee0>: Abbrev Number: 0
 <1><ee1>: Abbrev Number: 19 (DW_TAG_subprogram)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x407): kstack_end
    <ee6>   DW_AT_decl_file   : 2
    <ee7>   DW_AT_decl_line   : 6
    <ee8>   DW_AT_decl_column : 19
    <ee9>   DW_AT_prototyped  : 1
    <ee9>   DW_AT_type        : <0xcbc>
    <eed>   DW_AT_low_pc      : 0x80000608
    <ef5>   DW_AT_high_pc     : 0x40
    <efd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eff>   DW_AT_GNU_all_call_sites: 1
    <eff>   DW_AT_sibling     : <0xf13>
 <2><f03>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <f04>   DW_AT_name        : (indirect string, offset: 0x337): addr
    <f08>   DW_AT_decl_file   : 2
    <f09>   DW_AT_decl_line   : 6
    <f0a>   DW_AT_decl_column : 36
    <f0b>   DW_AT_type        : <0xe18>
    <f0f>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><f12>: Abbrev Number: 0
 <1><f13>: Abbrev Number: 21 (DW_TAG_subprogram)
    <f14>   DW_AT_name        : (indirect string, offset: 0x2a4): printk_unused
    <f18>   DW_AT_decl_file   : 1
    <f19>   DW_AT_decl_line   : 32
    <f1a>   DW_AT_decl_column : 36
    <f1b>   DW_AT_prototyped  : 1
    <f1b>   DW_AT_low_pc      : 0x800005cc
    <f23>   DW_AT_high_pc     : 0x3c
    <f2b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f2d>   DW_AT_GNU_all_call_sites: 1
    <f2d>   DW_AT_sibling     : <0xf43>
 <2><f31>: Abbrev Number: 11 (DW_TAG_formal_parameter)
    <f32>   DW_AT_name        : fmt
    <f36>   DW_AT_decl_file   : 1
    <f37>   DW_AT_decl_line   : 32
    <f38>   DW_AT_decl_column : 62
    <f39>   DW_AT_type        : <0xf43>
    <f3d>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><f41>: Abbrev Number: 22 (DW_TAG_unspecified_parameters)
 <2><f42>: Abbrev Number: 0
 <1><f43>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <f44>   DW_AT_byte_size   : 8
    <f45>   DW_AT_type        : <0xcfd>
 <1><f49>: Abbrev Number: 0
  Compilation Unit @ offset 0xf4a:
   Length:        0x826 (32-bit)
   Version:       4
   Abbrev Offset: 0x6dd
   Pointer Size:  8
 <0><f55>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <f56>   DW_AT_producer    : (indirect string, offset: 0xe7): GNU C17 8.3.0 -mstrict-align -mcmodel=medany -mabi=lp64 -march=rv64ima -g -O0 -ffreestanding -fno-stack-protector -fno-strict-aliasing -fno-jump-tables -ffunction-sections -fdata-sections -fno-PIE
    <f5a>   DW_AT_language    : 12	(ANSI C99)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x59b): kernel/libfdt/fdt.c
    <f5f>   DW_AT_comp_dir    : (indirect string, offset: 0xd): /serval/
    <f63>   DW_AT_ranges      : 0x200
    <f67>   DW_AT_low_pc      : 0x0
    <f6f>   DW_AT_stmt_list   : 0xb74
 <1><f73>: Abbrev Number: 2 (DW_TAG_base_type)
    <f74>   DW_AT_byte_size   : 1
    <f75>   DW_AT_encoding    : 6	(signed char)
    <f76>   DW_AT_name        : (indirect string, offset: 0xab): signed char
 <1><f7a>: Abbrev Number: 2 (DW_TAG_base_type)
    <f7b>   DW_AT_byte_size   : 2
    <f7c>   DW_AT_encoding    : 5	(signed)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x4b): short int
 <1><f81>: Abbrev Number: 3 (DW_TAG_base_type)
    <f82>   DW_AT_byte_size   : 4
    <f83>   DW_AT_encoding    : 5	(signed)
    <f84>   DW_AT_name        : int
 <1><f88>: Abbrev Number: 2 (DW_TAG_base_type)
    <f89>   DW_AT_byte_size   : 8
    <f8a>   DW_AT_encoding    : 5	(signed)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x7b): long int
 <1><f8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <f90>   DW_AT_name        : (indirect string, offset: 0x69): uint8_t
    <f94>   DW_AT_decl_file   : 5
    <f95>   DW_AT_decl_line   : 46
    <f96>   DW_AT_decl_column : 24
    <f97>   DW_AT_type        : <0xfa0>
 <1><f9b>: Abbrev Number: 5 (DW_TAG_const_type)
    <f9c>   DW_AT_type        : <0xf8f>
 <1><fa0>: Abbrev Number: 2 (DW_TAG_base_type)
    <fa1>   DW_AT_byte_size   : 1
    <fa2>   DW_AT_encoding    : 8	(unsigned char)
    <fa3>   DW_AT_name        : (indirect string, offset: 0xa9): unsigned char
 <1><fa7>: Abbrev Number: 2 (DW_TAG_base_type)
    <fa8>   DW_AT_byte_size   : 2
    <fa9>   DW_AT_encoding    : 7	(unsigned)
    <faa>   DW_AT_name        : (indirect string, offset: 0xce): short unsigned int
 <1><fae>: Abbrev Number: 4 (DW_TAG_typedef)
    <faf>   DW_AT_name        : (indirect string, offset: 0x35d): uint32_t
    <fb3>   DW_AT_decl_file   : 5
    <fb4>   DW_AT_decl_line   : 52
    <fb5>   DW_AT_decl_column : 25
    <fb6>   DW_AT_type        : <0xfbf>
 <1><fba>: Abbrev Number: 5 (DW_TAG_const_type)
    <fbb>   DW_AT_type        : <0xfae>
 <1><fbf>: Abbrev Number: 2 (DW_TAG_base_type)
    <fc0>   DW_AT_byte_size   : 4
    <fc1>   DW_AT_encoding    : 7	(unsigned)
    <fc2>   DW_AT_name        : (indirect string, offset: 0xc1): unsigned int
 <1><fc6>: Abbrev Number: 2 (DW_TAG_base_type)
    <fc7>   DW_AT_byte_size   : 8
    <fc8>   DW_AT_encoding    : 7	(unsigned)
    <fc9>   DW_AT_name        : (indirect string, offset: 0xbc): long unsigned int
 <1><fcd>: Abbrev Number: 4 (DW_TAG_typedef)
    <fce>   DW_AT_name        : (indirect string, offset: 0x330): be32_t
    <fd2>   DW_AT_decl_file   : 6
    <fd3>   DW_AT_decl_line   : 16
    <fd4>   DW_AT_decl_column : 18
    <fd5>   DW_AT_type        : <0xfae>
 <1><fd9>: Abbrev Number: 2 (DW_TAG_base_type)
    <fda>   DW_AT_byte_size   : 1
    <fdb>   DW_AT_encoding    : 2	(boolean)
    <fdc>   DW_AT_name        : (indirect string, offset: 0xe1): _Bool
 <1><fe0>: Abbrev Number: 2 (DW_TAG_base_type)
    <fe1>   DW_AT_byte_size   : 1
    <fe2>   DW_AT_encoding    : 8	(unsigned char)
    <fe3>   DW_AT_name        : (indirect string, offset: 0xb2): char
 <1><fe7>: Abbrev Number: 5 (DW_TAG_const_type)
    <fe8>   DW_AT_type        : <0xfe0>
 <1><fec>: Abbrev Number: 2 (DW_TAG_base_type)
    <fed>   DW_AT_byte_size   : 8
    <fee>   DW_AT_encoding    : 5	(signed)
    <fef>   DW_AT_name        : (indirect string, offset: 0x76): long long int
 <1><ff3>: Abbrev Number: 2 (DW_TAG_base_type)
    <ff4>   DW_AT_byte_size   : 8
    <ff5>   DW_AT_encoding    : 7	(unsigned)
    <ff6>   DW_AT_name        : (indirect string, offset: 0xb7): long long unsigned int
 <1><ffa>: Abbrev Number: 4 (DW_TAG_typedef)
    <ffb>   DW_AT_name        : (indirect string, offset: 0xdfc): size_t
    <fff>   DW_AT_decl_file   : 7
    <1000>   DW_AT_decl_line   : 216
    <1001>   DW_AT_decl_column : 23
    <1002>   DW_AT_type        : <0xfc6>
 <1><1006>: Abbrev Number: 2 (DW_TAG_base_type)
    <1007>   DW_AT_byte_size   : 16
    <1008>   DW_AT_encoding    : 4	(float)
    <1009>   DW_AT_name        : (indirect string, offset: 0x9d): long double
 <1><100d>: Abbrev Number: 6 (DW_TAG_array_type)
    <100e>   DW_AT_type        : <0xfe7>
    <1012>   DW_AT_sibling     : <0x1018>
 <2><1016>: Abbrev Number: 7 (DW_TAG_subrange_type)
 <2><1017>: Abbrev Number: 0
 <1><1018>: Abbrev Number: 5 (DW_TAG_const_type)
    <1019>   DW_AT_type        : <0x100d>
 <1><101d>: Abbrev Number: 8 (DW_TAG_variable)
    <101e>   DW_AT_name        : (indirect string, offset: 0x1be): hex_asc
    <1022>   DW_AT_decl_file   : 8
    <1023>   DW_AT_decl_line   : 193
    <1024>   DW_AT_decl_column : 19
    <1025>   DW_AT_type        : <0x1018>
    <1029>   DW_AT_external    : 1
    <1029>   DW_AT_declaration : 1
 <1><1029>: Abbrev Number: 8 (DW_TAG_variable)
    <102a>   DW_AT_name        : (indirect string, offset: 0x1d9): hex_asc_upper
    <102e>   DW_AT_decl_file   : 8
    <102f>   DW_AT_decl_line   : 204
    <1030>   DW_AT_decl_column : 19
    <1031>   DW_AT_type        : <0x1018>
    <1035>   DW_AT_external    : 1
    <1035>   DW_AT_declaration : 1
 <1><1035>: Abbrev Number: 4 (DW_TAG_typedef)
    <1036>   DW_AT_name        : (indirect string, offset: 0x5c1): fdt32_t
    <103a>   DW_AT_decl_file   : 9
    <103b>   DW_AT_decl_line   : 7
    <103c>   DW_AT_decl_column : 16
    <103d>   DW_AT_type        : <0xfcd>
 <1><1041>: Abbrev Number: 5 (DW_TAG_const_type)
    <1042>   DW_AT_type        : <0x1035>
 <1><1046>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1047>   DW_AT_name        : (indirect string, offset: 0x50d): fdt_header
    <104b>   DW_AT_byte_size   : 40
    <104c>   DW_AT_decl_file   : 10
    <104d>   DW_AT_decl_line   : 57
    <104e>   DW_AT_decl_column : 8
    <104f>   DW_AT_sibling     : <0x10d6>
 <2><1053>: Abbrev Number: 10 (DW_TAG_member)
    <1054>   DW_AT_name        : (indirect string, offset: 0x648): magic
    <1058>   DW_AT_decl_file   : 10
    <1059>   DW_AT_decl_line   : 58
    <105a>   DW_AT_decl_column : 17
    <105b>   DW_AT_type        : <0x1035>
    <105f>   DW_AT_data_member_location: 0
 <2><1060>: Abbrev Number: 10 (DW_TAG_member)
    <1061>   DW_AT_name        : (indirect string, offset: 0x482): totalsize
    <1065>   DW_AT_decl_file   : 10
    <1066>   DW_AT_decl_line   : 59
    <1067>   DW_AT_decl_column : 17
    <1068>   DW_AT_type        : <0x1035>
    <106c>   DW_AT_data_member_location: 4
 <2><106d>: Abbrev Number: 10 (DW_TAG_member)
    <106e>   DW_AT_name        : (indirect string, offset: 0x4e7): off_dt_struct
    <1072>   DW_AT_decl_file   : 10
    <1073>   DW_AT_decl_line   : 60
    <1074>   DW_AT_decl_column : 17
    <1075>   DW_AT_type        : <0x1035>
    <1079>   DW_AT_data_member_location: 8
 <2><107a>: Abbrev Number: 10 (DW_TAG_member)
    <107b>   DW_AT_name        : (indirect string, offset: 0x540): off_dt_strings
    <107f>   DW_AT_decl_file   : 10
    <1080>   DW_AT_decl_line   : 61
    <1081>   DW_AT_decl_column : 17
    <1082>   DW_AT_type        : <0x1035>
    <1086>   DW_AT_data_member_location: 12
 <2><1087>: Abbrev Number: 10 (DW_TAG_member)
    <1088>   DW_AT_name        : (indirect string, offset: 0x49d): off_mem_rsvmap
    <108c>   DW_AT_decl_file   : 10
    <108d>   DW_AT_decl_line   : 62
    <108e>   DW_AT_decl_column : 17
    <108f>   DW_AT_type        : <0x1035>
    <1093>   DW_AT_data_member_location: 16
 <2><1094>: Abbrev Number: 10 (DW_TAG_member)
    <1095>   DW_AT_name        : (indirect string, offset: 0x465): version
    <1099>   DW_AT_decl_file   : 10
    <109a>   DW_AT_decl_line   : 63
    <109b>   DW_AT_decl_column : 17
    <109c>   DW_AT_type        : <0x1035>
    <10a0>   DW_AT_data_member_location: 20
 <2><10a1>: Abbrev Number: 10 (DW_TAG_member)
    <10a2>   DW_AT_name        : (indirect string, offset: 0x45b): last_comp_version
    <10a6>   DW_AT_decl_file   : 10
    <10a7>   DW_AT_decl_line   : 64
    <10a8>   DW_AT_decl_column : 17
    <10a9>   DW_AT_type        : <0x1035>
    <10ad>   DW_AT_data_member_location: 24
 <2><10ae>: Abbrev Number: 10 (DW_TAG_member)
    <10af>   DW_AT_name        : (indirect string, offset: 0x4f5): boot_cpuid_phys
    <10b3>   DW_AT_decl_file   : 10
    <10b4>   DW_AT_decl_line   : 67
    <10b5>   DW_AT_decl_column : 17
    <10b6>   DW_AT_type        : <0x1035>
    <10ba>   DW_AT_data_member_location: 28
 <2><10bb>: Abbrev Number: 10 (DW_TAG_member)
    <10bc>   DW_AT_name        : (indirect string, offset: 0x54f): size_dt_strings
    <10c0>   DW_AT_decl_file   : 10
    <10c1>   DW_AT_decl_line   : 70
    <10c2>   DW_AT_decl_column : 17
    <10c3>   DW_AT_type        : <0x1035>
    <10c7>   DW_AT_data_member_location: 32
 <2><10c8>: Abbrev Number: 10 (DW_TAG_member)
    <10c9>   DW_AT_name        : (indirect string, offset: 0x5ed): size_dt_struct
    <10cd>   DW_AT_decl_file   : 10
    <10ce>   DW_AT_decl_line   : 73
    <10cf>   DW_AT_decl_column : 17
    <10d0>   DW_AT_type        : <0x1035>
    <10d4>   DW_AT_data_member_location: 36
 <2><10d5>: Abbrev Number: 0
 <1><10d6>: Abbrev Number: 11 (DW_TAG_subprogram)
    <10d7>   DW_AT_external    : 1
    <10d7>   DW_AT_name        : (indirect string, offset: 0x62d): fdt_move
    <10db>   DW_AT_decl_file   : 4
    <10dc>   DW_AT_decl_line   : 322
    <10de>   DW_AT_decl_column : 5
    <10df>   DW_AT_prototyped  : 1
    <10df>   DW_AT_type        : <0xf81>
    <10e3>   DW_AT_low_pc      : 0x0
    <10eb>   DW_AT_high_pc     : 0x0
    <10f3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <10f5>   DW_AT_GNU_all_tail_call_sites: 1
    <10f5>   DW_AT_sibling     : <0x114c>
 <2><10f9>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <10fa>   DW_AT_name        : fdt
    <10fe>   DW_AT_decl_file   : 4
    <10ff>   DW_AT_decl_line   : 322
    <1101>   DW_AT_decl_column : 26
    <1102>   DW_AT_type        : <0x114c>
    <1106>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><1109>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <110a>   DW_AT_name        : buf
    <110e>   DW_AT_decl_file   : 4
    <110f>   DW_AT_decl_line   : 322
    <1111>   DW_AT_decl_column : 37
    <1112>   DW_AT_type        : <0x1153>
    <1116>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><1119>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <111a>   DW_AT_name        : (indirect string, offset: 0x606): bufsize
    <111e>   DW_AT_decl_file   : 4
    <111f>   DW_AT_decl_line   : 322
    <1121>   DW_AT_decl_column : 46
    <1122>   DW_AT_type        : <0xf81>
    <1126>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><1129>: Abbrev Number: 14 (DW_TAG_lexical_block)
    <112a>   DW_AT_low_pc      : 0x0
    <1132>   DW_AT_high_pc     : 0x0
 <3><113a>: Abbrev Number: 15 (DW_TAG_variable)
    <113b>   DW_AT_name        : (indirect string, offset: 0x55f): err_
    <113f>   DW_AT_decl_file   : 4
    <1140>   DW_AT_decl_line   : 324
    <1142>   DW_AT_decl_column : 9
    <1143>   DW_AT_type        : <0xf81>
    <1147>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><114a>: Abbrev Number: 0
 <2><114b>: Abbrev Number: 0
 <1><114c>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <114d>   DW_AT_byte_size   : 8
    <114e>   DW_AT_type        : <0x1152>
 <1><1152>: Abbrev Number: 17 (DW_TAG_const_type)
 <1><1153>: Abbrev Number: 18 (DW_TAG_pointer_type)
    <1154>   DW_AT_byte_size   : 8
 <1><1155>: Abbrev Number: 11 (DW_TAG_subprogram)
    <1156>   DW_AT_external    : 1
    <1156>   DW_AT_name        : (indirect string, offset: 0x52f): fdt_find_string_
    <115a>   DW_AT_decl_file   : 4
    <115b>   DW_AT_decl_line   : 310
    <115d>   DW_AT_decl_column : 13
    <115e>   DW_AT_prototyped  : 1
    <115e>   DW_AT_type        : <0x11d6>
    <1162>   DW_AT_low_pc      : 0x0
    <116a>   DW_AT_high_pc     : 0x0
    <1172>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1174>   DW_AT_GNU_all_tail_call_sites: 1
    <1174>   DW_AT_sibling     : <0x11d6>
 <2><1178>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1179>   DW_AT_name        : (indirect string, offset: 0x5c9): strtab
    <117d>   DW_AT_decl_file   : 4
    <117e>   DW_AT_decl_line   : 310
    <1180>   DW_AT_decl_column : 42
    <1181>   DW_AT_type        : <0x11d6>
    <1185>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><1188>: Abbrev Number: 13 (DW_TAG_formal_parameter)
    <1189>   DW_AT_name        : (indirect string, offset: 0x5d0): tabsize
    <118d>   DW_AT_decl_file   : 4
    <118e>   DW_AT_decl_line   : 310
    <1190>   DW_AT_decl_column : 54
    <1191>   DW_AT_type        : <0xf81>
    <1195>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><1198>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <1199>   DW_AT_name        : s
    <119b>   DW_AT_decl_file   : 4
    <119c>   DW_AT_decl_line   : 310
    <119e>   DW_AT_decl_column : 75
    <119f>   DW_AT_type        : <0x11d6>
    <11a3>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><11a7>: Abbrev Number: 19 (DW_TAG_variable)
    <11a8>   DW_AT_name        : len
    <11ac>   DW_AT_decl_file   : 4
    <11ad>   DW_AT_decl_line   : 312
    <11af>   DW_AT_decl_column : 13
    <11b0>   DW_AT_type        : <0xf81>
    <11b4>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><11b7>: Abbrev Number: 15 (DW_TAG_variable)
    <11b8>   DW_AT_name        : (indirect string, offset: 0x5bc): last
    <11bc>   DW_AT_decl_file   : 4
    <11bd>   DW_AT_decl_line   : 313
    <11bf>   DW_AT_decl_column : 21
    <11c0>   DW_AT_type        : <0x11d6>
    <11c4>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><11c7>: Abbrev Number: 19 (DW_TAG_variable)
    <11c8>   DW_AT_name        : p
    <11ca>   DW_AT_decl_file   : 4
    <11cb>   DW_AT_decl_line   : 314
    <11cd>   DW_AT_decl_column : 21
    <11ce>   DW_AT_type        : <0x11d6>
    <11d2>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><11d5>: Abbrev Number: 0
 <1><11d6>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <11d7>   DW_AT_byte_size   : 8
    <11d8>   DW_AT_type        : <0xfe7>
 <1><11dc>: Abbrev Number: 11 (DW_TAG_subprogram)
    <11dd>   DW_AT_external    : 1
    <11dd>   DW_AT_name        : (indirect string, offset: 0x564): fdt_next_subnode
    <11e1>   DW_AT_decl_file   : 4
